//OZA194V    JOB  '123-WIPRO','MADHAV',TIME=(2,30),NOTIFY=&SYSUID,
// RESTART=STEP04
//* -------------------------------------------------------------------
//* --- DEFINE KSDS CLUSTER -------------------------------------------
//* -------------------------------------------------------------------
//STEP01     EXEC PGM=IDCAMS
//SYSPRINT   DD   SYSOUT=*
//SYSIN      DD   *
    DELETE OZA194.WIPRO.STUDENT.KSDS.CLUSTER)
    DEFINE CLUSTER(NAME(OZA194.WIPRO.STUDENT.KSDS.CLUSTER) -
                   VOLUMES(USR002) -
                   INDEXED -
                   TRACKS(10,7) -
                   KEYS(3,0) -
                   RECORDSIZE(80 80) -
                   NOREUSE) -
             INDEX(NAME(OZA194.WIPRO.STUDET.KSDS.INDEX)) -
              DATA(NAME(OZA194.WIPRO.STUDENT.KSDS.DATA))
/*
//* -------------------------------------------------------------------
//* --- COPY DATA TO KSDS CLUSTER -------------------------------------
//* -------------------------------------------------------------------
//STEP02     EXEC PGM=IDCAMS
//SYSPRINT   DD   SYSOUT=*
//DD01       DD   DSN=OZA194.WIPRO.INPUT.FILE02,DISP=OLD
//DD02       DD   DSN=OZA194.WIPRO.STUDENT.KSDS.CLUSTER,DISP=OLD
//SYSIN      DD   *
    REPRO INFILE(DD01)  OUTFILE(DD02) REUSE
/*
//* -------------------------------------------------------------------
//* --- DEFINE AIX CLUSTER (UNIQUE VALUES) ----------------------------
//* -------------------------------------------------------------------
//STEP03     EXEC PGM=IDCAMS
//SYSPRINT   DD   SYSOUT=*
//SYSIN      DD   *
   DELETE OZA194.WIPRO.GRADE.AIX.CLUSTER

   DEFINE AIX(NAME(OZA194.WIPRO.GRADE.AIX.CLUSTER) -
              RELATE(OZA194.WIPRO.STUDENT.KSDS.CLUSTER) -
              VOLUMES(USR002) -
              TRACKS(10,7) -
              KEYS(06,15) -
              RECORDSIZE(80,80) -
              UPGRADE -
              UNIQUEKEY) -
        INDEX(NAME(OZA194.WIPRO.GRADE.AIX.INDEX)) -
         DATA(NAME(OZA194.WIPRO.GRADE.AIX.DATA))
/*
//* -------------------------------------------------------------------
//* --- POPULATE DATA IN AIX CLUSTER ----------------------------------
//* -------------------------------------------------------------------
//STEP04     EXEC PGM=IDCAMS
//SYSPRINT   DD   SYSOUT=*
//DD01       DD   DSN=OZA194.WIPRO.STUDENT.KSDS.CLUSTER,DISP=OLD
//DD02       DD   DSN=OZA194.WIPRO.GRADE.AIX.CLUSTER,DISP=OLD
//SYSIN      DD   *
    BLDINDEX INFILE(DD01) OUTFILE(DD02)
/*
//* -------------------------------------------------------------------
//* --- DEFINE A PATH FOR AIX CLUSTER ---------------------------------
//* -------------------------------------------------------------------
//STEP05     EXEC PGM=IDCAMS
//SYSPRINT   DD   SYSOUT=*
//SYSIN      DD   *
    DEFINE PATH(NAME(OZA194.WIPRO.GRADE.AIX.PATH) -
                PATHENTRY(OZA194.WIPRO.GRADE.AIX.CLUSTER))
/*
//* -------------------------------------------------------------------
