//OZA194V    JOB  '123-WIPRO','MADHAV',TIME=(2,30),NOTIFY=&SYSUID
//* -------------------------------------------------------------------
//* --- DEFINE AIX CLUSTER (DUPLICATE VALUES) -------------------------
//* -------------------------------------------------------------------
//STEP01     EXEC PGM=IDCAMS
//SYSPRINT   DD   SYSOUT=*
//SYSIN      DD   *
   DELETE OZA194.WIPRO.EMAILID.AIX.CLUSTER

   DEFINE AIX(NAME(OZA194.WIPRO.EMAILID.AIX.CLUSTER) -
              RELATE(OZA194.WIPRO.STUDENT.KSDS.CLUSTER) -
              VOLUMES(USR002) -
              TRACKS(10,7) -
              KEYS(22,25) -
              RECORDSIZE(80,80) -
              UPGRADE -
              NONUNIQUEKEY) -
        INDEX(NAME(OZA194.WIPRO.EMAILID.AIX.INDEX)) -
         DATA(NAME(OZA194.WIPRO.EMAILID.AIX.DATA))
/*
//* -------------------------------------------------------------------
//* --- POPULATE DATA IN AIX CLUSTER ----------------------------------
//* -------------------------------------------------------------------
//STEP02     EXEC PGM=IDCAMS
//SYSPRINT   DD   SYSOUT=*
//DD01       DD   DSN=OZA194.WIPRO.STUDENT.KSDS.CLUSTER,DISP=OLD
//DD02       DD   DSN=OZA194.WIPRO.EMAILID.AIX.CLUSTER,DISP=OLD
//SYSIN      DD   *
    BLDINDEX INFILE(DD01) OUTFILE(DD02)
/*
//* -------------------------------------------------------------------
//* --- DEFINE A PATH FOR AIX CLUSTER ---------------------------------
//* -------------------------------------------------------------------
//STEP03     EXEC PGM=IDCAMS
//SYSPRINT   DD   SYSOUT=*
//SYSIN      DD   *
    DEFINE PATH(NAME(OZA194.WIPRO.EMAILID.AIX.PATH) -
                PATHENTRY(OZA194.WIPRO.EMAILID.AIX.CLUSTER))
/*
//* -------------------------------------------------------------------
