//OZA194V    JOB  '123-WIPRO','MADHAV',TIME=(2,30),NOTIFY=&SYSUID,
// RESTART=STEP04
//* -------------------------------------------------------------------
//* --- DELETE KSDS CLUSTER -------------------------------------------
//* -------------------------------------------------------------------
//STEP01     EXEC PGM=IDCAMS
//SYSPRINT   DD   SYSOUT=*
//SYSIN      DD   *
     DELETE OZA194.WIPRO.STUDENT.KSDS.CLUSTER
/*
//* -------------------------------------------------------------------
//* --- SORT ON EMPNO AND ELIMINATE DUPLICATES ------------------------
//* -------------------------------------------------------------------
//STEP02     EXEC PGM=SORT
//SYSOUT     DD   SYSOUT=*
//SORTIN     DD   DSN=OZA194.WIPRO.SAMPLE.DATA,DISP=OLD
//SORTWK01   DD   UNIT=SYSDA,SPACE=(TRK,(1,1))
//SORTOUT    DD   DSN=OZA194.WIPRO.INPUT.FILE01,DISP=OLD
//SYSIN      DD   *
 SORT FIELDS=(1,3,CH,A)
 SUM FIELDS=NONE
/*
//* -------------------------------------------------------------------
//* --- DEFINE KSDS CLUSTER -------------------------------------------
//* -------------------------------------------------------------------
//STEP03     EXEC PGM=IDCAMS
//SYSPRINT   DD   SYSOUT=*
//SYSIN      DD   *
    DEFINE CLUSTER(NAME(OZA194.WIPRO.STUDENT.KSDS.CLUSTER) -
                   VOLUMES(USR002) -
                   INDEXED -
                   TRACKS(10,7) -
                   KEYS(3,0) -
                   RECORDSIZE(80 80) -
                   REUSE) -
             INDEX(NAME(OZA194.WIPRO.STUDENT.KSDS.INDEX)) -
              DATA(NAME(OZA194.WIPRO.STUDENT.KSDS.DATA))
/*
//* -------------------------------------------------------------------
//* --- COPY DATA TO KSDS CLUSTER -------------------------------------
//* -------------------------------------------------------------------
//STEP04     EXEC PGM=IDCAMS
//SYSPRINT   DD   SYSOUT=*
//DD01       DD   DSN=OZA194.WIPRO.INPUT.FILE02,DISP=OLD
//DD02       DD   DSN=OZA194.WIPRO.STUDENT.KSDS.CLUSTER,DISP=OLD
//SYSIN      DD   *
    REPRO INFILE(DD01)  OUTFILE(DD02) REUSE
/*
//* -------------------------------------------------------------------
//* --- DISPLAY KSDS CLUSTER IN SPOOL ---------------------------------
//* -------------------------------------------------------------------
//STEP05     EXEC PGM=IDCAMS
//SYSPRINT   DD   SYSOUT=*
//DD01       DD   DSN=OZA194.WIPRO.PRODUCT.KSDS.CLUSTER,DISP=OLD
//DD02       DD   SYSOUT=*
//SYSIN      DD   *
 REPRO INFILE(DD01) OUTFILE(DD02) REUSE
/*
//* -------------------------------------------------------------------
