      *----------------------------------------------------------------
      *---  WRITE VALID   RECORDS IN OUTPUT FILE ----------------------
      *---  WRITE INVALID RECORDS IN ERROR  FILE ----------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASSIGN05.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *--- ENTRIES FOR INPUT FILE -------------------------------------
           SELECT PS-IN-FILE ASSIGN TO DD01
           ORGANIZATION IS SEQUENTIAL
           FILE STATUS IS FS-PS-IN.

      *--- ENTRIES FOR OUTPUT FILE ------------------------------------
           SELECT PS-OUT-FILE ASSIGN TO DD02
           ORGANIZATION IS SEQUENTIAL
           FILE STATUS IS FS-PS-OUT.

      *--- ENTRIES FOR ERROR FILE -------------------------------------
           SELECT PS-ERR-FILE ASSIGN TO DD03
           ORGANIZATION IS SEQUENTIAL
           FILE STATUS IS FS-PS-ERR.
      *----------------------------------------------------------------
       DATA DIVISION.

       FILE SECTION.
       FD  PS-IN-FILE
           LABEL RECORDS ARE STANDARD
           RECORDING MODE IS F.
       01  INPUT-FILE-RB.
           05    FILLER        PIC X(80).

       FD  PS-OUT-FILE
           LABEL RECORDS ARE STANDARD
           RECORDING MODE IS F.
       01  OUTPUT-FILE-RB.
           05    FILLER        PIC X(80).

       FD  PS-ERR-FILE
           LABEL RECORDS ARE STANDARD
           RECORDING MODE IS F.
       01  ERROR-FILE-RB.
           05    FILLER        PIC X(80).

       WORKING-STORAGE SECTION.
       01  CANDIDATE-WS.
           05    CAND-NAME-WS  PIC X(10).
           05    FILLER        PIC X(01).
           05    BIRTH-WS      PIC 9(08).

       01  OUTPUT-WS.
           05    C-NAME-WS     PIC X(10).
           05    FILLER        PIC X(01).
           05    BIR-WS        PIC 9(08).
           05    FILLER        PIC X(01).
           05    AGE-WS        PIC 9(02).
           05    FILLER        PIC X(01).
           05    CATEGORY      PIC X(15).

       77        TODAYS-DATE-X      PIC X(08).
       77        TODAYS-DATE-9      PIC 9(08).
       77        TODAYS-DATE-G      PIC 9(07).
       77        BIRTH-WS-G       PIC 9(07).
       77        FS-PS-IN      PIC X(02)         VALUE SPACES.
       77        FS-PS-OUT     PIC X(02)         VALUE SPACES.
       77        FS-PS-ERR     PIC X(02)         VALUE SPACES.
       77        VALID-RECS    PIC 9(02)         VALUE ZERO.
       77        INVALID-RECS  PIC 9(02)         VALUE ZERO.
       77        TOTAL-RECS    PIC 9(02)         VALUE ZERO.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : COBPGM06".
           DISPLAY " ".

           PERFORM 1000-OPEN-PARA.

      *--- READ THE FIRST RECORD FROM THE FILE ------------------------
           READ PS-IN-FILE INTO CANDIDATE-WS.
           PERFORM 2000-CANDIDATE-PARA UNTIL FS-PS-IN = "10".

           PERFORM 3000-CLOSE-PARA.

           PERFORM 4000-SHOW-STATS-PARA.

           DISPLAY "THANK YOU FOR USING PROGRAM COBPGM06".
           STOP RUN.
      *----------------------------------------------------------------
      *--- OPEN THE FILE ----------------------------------------------
      *----------------------------------------------------------------
       1000-OPEN-PARA.
           OPEN INPUT PS-IN-FILE.
           DISPLAY "PS-IN-FILE OPEN STATUS  : ", FS-PS-IN.

           OPEN OUTPUT PS-OUT-FILE.
           DISPLAY "PS-OUT-FILE OPEN STATUS : ", FS-PS-OUT.

           OPEN OUTPUT PS-ERR-FILE.
           DISPLAY "PS-ERR-FILE OPEN STATUS : ", FS-PS-ERR.

           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS STUDENT RECORD -------------------------------------
      *----------------------------------------------------------------
       2000-CANDIDATE-PARA.
           EVALUATE TRUE
               WHEN CAND-NAME-WS = SPACES OR BIRTH-WS = ZERO
                    WRITE ERROR-FILE-RB FROM CANDIDATE-WS
                    COMPUTE INVALID-RECS = INVALID-RECS + 1
               WHEN BIRTH-WS IS NOT NUMERIC
                    WRITE ERROR-FILE-RB FROM CANDIDATE-WS
                    COMPUTE INVALID-RECS = INVALID-RECS + 1
               WHEN OTHER
                    PERFORM 2100-PROCESS-PARA
                    WRITE OUTPUT-FILE-RB FROM OUTPUT-WS
                    COMPUTE VALID-RECS = VALID-RECS + 1
           END-EVALUATE.
           COMPUTE TOTAL-RECS = TOTAL-RECS + 1.

      *--- READ NEXT RECORD FROM THE FILE -----------------------------
           READ PS-IN-FILE INTO CANDIDATE-WS.

           EXIT.
      *----------------------------------------------------------------
      *--- FIND THE GRADE ---------------------------------------------
      *----------------------------------------------------------------
       2100-PROCESS-PARA.
           MOVE CAND-NAME-WS TO C-NAME-WS.
           MOVE BIRTH-WS   TO BIR-WS.

           MOVE FUNCTION CURRENT-DATE TO TODAYS-DATE-X.
           MOVE TODAYS-DATE-X TO TODAYS-DATE-9.

           COMPUTE TODAYS-DATE-G =
                   FUNCTION INTEGER-OF-DATE(TODAYS-DATE-9).

           COMPUTE BIRTH-WS-G =
                   FUNCTION INTEGER-OF-DATE(BIR-WS).

           COMPUTE AGE-WS = ( TODAYS-DATE-G - BIRTH-WS-G ) / 365.
           EVALUATE TRUE
                WHEN AGE-WS < 10
                     MOVE "N.A" TO CATEGORY
                WHEN AGE-WS >= 10 AND AGE-WS < 15
                     MOVE "SUB-JUNIOR" TO CATEGORY
                WHEN AGE-WS >= 15 AND AGE-WS < 25
                     MOVE "JUNIOR" TO CATEGORY
                WHEN AGE-WS >= 25 AND AGE-WS < 40
                     MOVE "MIDGET" TO CATEGORY
                WHEN AGE-WS >= 40 AND AGE-WS < 50
                     MOVE "SENIOR" TO CATEGORY
                WHEN AGE-WS >= 50
                     MOVE "N.A" TO CATEGORY
           END-EVALUATE.
           EXIT.
      *----------------------------------------------------------------
      *--- CLOSE THE FILE ---------------------------------------------
      *----------------------------------------------------------------
       3000-CLOSE-PARA.
           DISPLAY " ".

           CLOSE PS-IN-FILE.
           DISPLAY "PS-IN-FILE CLOSE STATUS     : ", FS-PS-IN.

           CLOSE PS-OUT-FILE.
           DISPLAY "PS-OUT-FILE CLOSE STATUS     : ", FS-PS-OUT.

           CLOSE PS-ERR-FILE.
           DISPLAY "PS-ERR-FILE CLOSE STATUS    : ", FS-PS-ERR.

           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- DISPLAY THE STATISTICS -------------------------------------
      *----------------------------------------------------------------
       4000-SHOW-STATS-PARA.
           DISPLAY " ".
           DISPLAY "TOTAL RECORDS PROCESSED : ", TOTAL-RECS.
           DISPLAY "TOTAL RECORDS VALID     : ", VALID-RECS.
           DISPLAY "TOTAL RECORDS INVALID   : ", INVALID-RECS.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
