      *----------------------------------------------------------------
      *--- SIGNED VARIABLE --------------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASSIGN02.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01    CUSTOMER-DATA.
             05       CUSTO-NAME PIC  A(10).
             05       FILLER     PIC  X(01).
             05       SCHEM-NAME PIC  X(10).
             05       FILLER     PIC  X(01).
             05       INVE-AMT   PIC  9(04).9(02).
             05       FILLER     PIC  X(01).
             05       MATU-AMT   PIC  9(04).9(02).
             05       FILLER     PIC  X(01).
             05       PROFIT-LOS PIC +9(04).9(02).

       77             CTR        PIC  9(01)    VALUE 1.
       77             INVE-AMT-V PIC  9(04)V9(02).
       77             MATU-AMT-V PIC  9(04)V9(02).
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : ASSIGN02".
           DISPLAY " ".

           PERFORM 1000-CALCULA-PARA UNTIL CTR = 7.

           DISPLAY " ".
           DISPLAY "THANK YOU FOR USING PROGRAM ASSIGN02".
           STOP RUN.
      *----------------------------------------------------------------
      *--- SUBTRACT TWO NUMBERS ---------------------------------------
      *----------------------------------------------------------------
       1000-CALCULA-PARA.
           ACCEPT CUSTOMER-DATA.

           MOVE    INVE-AMT(1:4) TO    INVE-AMT-V(1:4).
           MOVE    INVE-AMT(6:2) TO    INVE-AMT-V(5:2).

           MOVE    MATU-AMT(1:4) TO MATU-AMT-V(1:4).
           MOVE    MATU-AMT(6:2) TO MATU-AMT-V(5:2).

           COMPUTE PROFIT-LOS = MATU-AMT-V - INVE-AMT-V.

           DISPLAY CUSTOMER-DATA.
           COMPUTE CTR = CTR + 1.
           EXIT.
      *----------------------------------------------------------------
