      *---------------------------------------------------------------  00010001
      *--- JOIN THREE STRINGS INTO ONE STRING  -----------------------  00020001
      *---------------------------------------------------------------  00030001
       IDENTIFICATION DIVISION.                                         00040001
       PROGRAM-ID. ASSIGN03.                                            00050003
      *---------------------------------------------------------------  00060001
       ENVIRONMENT DIVISION.                                            00070001
      *---------------------------------------------------------------  00080001
       DATA DIVISION.                                                   00090001
       WORKING-STORAGE SECTION.                                         00100001
       01   NAME-RECORD.                                                00110001
            05     D-NAME        PIC 9(02).                             00120002
            05     FILLER        PIC X(01).                             00130001
            05     M-NAME        PIC 9(02).                             00140002
            05     FILLER        PIC X(01).                             00150001
            05     Y-NAME        PIC 9(04).                             00160002
            05     FILLER        PIC X(01).                             00170001
            05     FULL-NAME     PIC X(10).                             00180002
      *---------------------------------------------------------------  00190001
       PROCEDURE DIVISION.                                              00200001
      *---------------------------------------------------------------  00210001
      *--- PROGRAM LOGIC STARTS HERE ---------------------------------  00220001
      *---------------------------------------------------------------  00230001
       0000-MAIN-PARA.                                                  00240001
            DISPLAY "WELCOME TO MY PROGRAM : ASSINM03".                 00250002
            DISPLAY " ".                                                00260001
                                                                        00270001
            ACCEPT NAME-RECORD.                                         00280001
                                                                        00290001
            STRING M-NAME DELIMITED BY " "                              00300002
                   "-"    DELIMITED BY SIZE                             00310001
                   D-NAME DELIMITED BY " "                              00320002
                   "-"    DELIMITED BY SIZE                             00330001
                   Y-NAME DELIMITED BY " "                              00340002
              INTO FULL-NAME.                                           00350001
                                                                        00360001
            DISPLAY NAME-RECORD.                                        00370001
                                                                        00380001
            DISPLAY " ".                                                00390001
            DISPLAY "THANK YOU FOR USING PROGRAM COBPGM12".             00400001
                                                                        00410001
            STOP RUN.                                                   00420001
      *---------------------------------------------------------------  00430001
