      *----------------------------------------------------------------
      *--- MAIN PROGRAM -----------------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MPGM01.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  EMPLOYEE-RECORD.
           05     EMPLOYEE-NAME        PIC X(10).
           05     FILLER               PIC X(01).
           05     BASIC-SAL            PIC 9(05).
           05     DA                   PIC 9(05).
           05     FILLER               PIC X(01).
           05     HRA                  PIC 9(05).
           05     FILLER               PIC X(01).
           05     GROSS                PIC 9(05).

       77         PGM-NAME             PIC X(08).
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : MPGM01".
           DISPLAY " ".

           ACCEPT EMPLOYEE-RECORD.

           MOVE "SPGM01" TO PGM-NAME.
           CALL PGM-NAME USING EMPLOYEE-RECORD.

           DISPLAY EMPLOYEE-RECORD.

           DISPLAY " ".
           DISPLAY "THANK YOU FOR USING PROGRAM MPGM01".
           STOP RUN.
      *----------------------------------------------------------------
