      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPGM01.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  CUSTOMER-RECORD.
           05     CUST-NAME     PIC A(15).
           05     FILLER        PIC X(01).
           05     BILL-AMT      PIC 9(06).
           05     FILLER        PIC X(01).
           05     PAID-AMT      PIC 9(06).
           05     FILLER        PIC X(01).
           05     STAT          PIC A(15).
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : COBPGM01".
           DISPLAY " ".

           ACCEPT CUSTOMER-RECORD.

           IF BILL-AMT = PAID-AMT
              MOVE "FULLY-PAID" TO STAT
            ELSE
              IF BILL-AMT < PAID-AMT
                 MOVE "CARRY-PAID" TO STAT
              ELSE
                 IF PAID-AMT = 0
                 MOVE "NOT-PAID" TO STAT
              ELSE
                 MOVE "PARTLY-PAID" TO STAT
              END-IF
            END-IF
            END-IF.
           DISPLAY CUSTOMER-RECORD.
           DISPLAY " ".

           DISPLAY "THANK YOU FOR USING COBPGM01".
           STOP RUN.
