      *----------------------------------------------------------------
      *--- ADDITION OF TWO NUMBERS ------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COBPGM01.
       AUTHOR.        MADHAV.
       DATE-WRITTEN.  24TH JULY 2024.
       DATE-COMPILED. 24TH JULY 2024.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUMBER-RECORD.
           05     NUM-1      PIC  9(04).
           05     FILLER     PIC  X(01).
           05     NUM-2      PIC  9(04).
           05     FILLER     PIC  X(01).
           05     RESULT     PIC  9(05).
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : COBPGM01".
           DISPLAY " ".

           ACCEPT NUMBER-RECORD.

           COMPUTE RESULT = NUM-1 + NUM-2.

           DISPLAY "SUM OF ", NUM-1, " AND ", NUM-2, " = ", RESULT.
           DISPLAY " ".

           DISPLAY "THANK YOU FOR USING PROGRAM COBPGM01".
           STOP RUN.
      *----------------------------------------------------------------
