      *----------------------------------------------------------------
      *--- REFERENCE MODIFICATION -------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPGM14.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01    DATE-RECORD.
             05       DATE-1     PIC  X(10).
             05       FILLER     PIC  X(01).
             05       DATE-2     PIC  X(10).

       77             CTR        PIC  9(01)    VALUE 1.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : COBPGM14".
           DISPLAY " ".

           PERFORM 1000-DATE-PARA UNTIL CTR = 6.

           DISPLAY " ".
           DISPLAY "THANK YOU FOR USING PROGRAM COBPGM14".
           STOP RUN.
      *----------------------------------------------------------------
      *--- CHANGE DATE FORMAT  FROM DD-MM-YYYY TO MM/DD/YYYY ----------
      *----------------------------------------------------------------
       1000-DATE-PARA.
           ACCEPT DATE-RECORD.

           MOVE DATE-1(1:4) TO DATE-2(1:4).
           MOVE "/"         TO DATE-2(5:1).
           MOVE DATE-1(6:2) TO DATE-2(6:2).
           MOVE "/"         TO DATE-2(8:1).
           MOVE DATE-1(9:1) TO DATE-2(9:1).

           DISPLAY DATE-RECORD.

           COMPUTE CTR = CTR + 1.
           EXIT.
      *----------------------------------------------------------------
