      *----------------------------------------------------------------
      *--- INTRINSIC FUNCTIONS ----------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPGM17.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01   DATE-RECORD.
            05     TODAYS-DATE-X      PIC X(08).
            05     FILLER             PIC X(01).
            05     TODAYS-DATE-9      PIC 9(08).
            05     FILLER             PIC X(01).
            05     TODAYS-DATE-FRM    PIC 9999/99/99.
            05     FILLER             PIC X(01).
            05     GREGORIAN-DATE     PIC 9(07).
            05     FILLER             PIC X(01).
            05     JULIAN-DATE        PIC 9(07).
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : COBPGM17".
           DISPLAY " ".

           MOVE FUNCTION CURRENT-DATE TO TODAYS-DATE-X.
           MOVE TODAYS-DATE-X TO TODAYS-DATE-9.
           MOVE TODAYS-DATE-X TO TODAYS-DATE-FRM.
           COMPUTE GREGORIAN-DATE =
                   FUNCTION INTEGER-OF-DATE(TODAYS-DATE-9).
           COMPUTE JULIAN-DATE =
                   FUNCTION DAY-OF-INTEGER(GREGORIAN-DATE).

           DISPLAY DATE-RECORD.

           DISPLAY " ".
           DISPLAY "THANK YOU FOR USING PROGRAM COBPGM17".
           GOBACK.
      *----------------------------------------------------------------
