      *----------------------------------------------------------------
      *--- MAIN PROGRAM -----------------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MPGM16.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77      VAR-A                   PIC 9(03).
       77      PGM-NAME                PIC X(08).
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : MPGM16".
           DISPLAY " ".

           MOVE 10 TO VAR-A.

           MOVE "SPGM16" TO PGM-NAME.
           CALL PGM-NAME USING BY REFERENCE VAR-A.
           DISPLAY "VAR-A = ", VAR-A.

           CALL PGM-NAME USING   VAR-A.
           DISPLAY "VAR-A = ", VAR-A.

           DISPLAY " ".
           DISPLAY "THANK YOU FOR USING PROGRAM MPGM16".
           GOBACK.
      *----------------------------------------------------------------
