      *----------------------------------------------------------------
      *--- EVALUATE STATEMENT -----------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPGM06.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01   STUDENT-RECORD.
            05     STUD-NAME     PIC A(15).
            05     FILLER        PIC X(01).
            05     PERCENT       PIC 9(03).
            05     FILLER        PIC X(01).
            05     GRADE         PIC A(06).
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       MAIN-PARA.
            DISPLAY "WELCOME TO MY PROGRAM : COBPGM06".
            DISPLAY " ".

            ACCEPT STUDENT-RECORD.

            EVALUATE TRUE
                 WHEN PERCENT >= 75
                      MOVE "DISTN" TO GRADE
                 WHEN PERCENT >= 60 AND PERCENT < 75
                      MOVE "FIRST" TO GRADE
                 WHEN PERCENT >= 50 AND PERCENT < 60
                      MOVE "SECOND" TO GRADE
                 WHEN PERCENT >= 35 AND PERCENT < 50
                      MOVE "THIRD" TO GRADE
                 WHEN OTHER
                      MOVE "FAIL" TO GRADE
            END-EVALUATE.

            DISPLAY STUDENT-RECORD.
            DISPLAY " ".

            DISPLAY "THANK YOU FOR USING PROGRAM COBPGM06".
            STOP RUN.
      *----------------------------------------------------------------
