      *----------------------------------------------------------------
      *--- SUB PROGRAM ------------------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SPGM15.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       LINKAGE SECTION.
       01  DATA-RECORD.
           05     STUD-NAME            PIC X(10).
           05     FILLER               PIC X(01).
           05     MKS-1                PIC 9(03).
           05     FILLER               PIC X(01).
           05     MKS-2                PIC 9(03).
           05     FILLER               PIC X(01).
           05     MKS-3                PIC 9(03).
           05     FILLER               PIC X(01).
           05     TOTAL                PIC 9(03).
           05     FILLER               PIC X(01).
           05     PERCENT              PIC 9(02).
           05     FILLER               PIC X(01).
           05     RESULT               PIC X(04).
      *----------------------------------------------------------------
       PROCEDURE DIVISION USING DATA-RECORD.
      *----------------------------------------------------------------
      *--- PROGRAM LOGICS STARTS HERE ---------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           COMPUTE TOTAL = MKS-1 + MKS-2 + MKS-3.
           COMPUTE PERCENT = TOTAL / 3.
           IF MKS-1 >= 35 AND MKS-2 >= 35 AND MKS-3 >= 35
              MOVE "PASS" TO RESULT
           ELSE
              MOVE "FAIL" TO RESULT
           END-IF.
           EXIT PROGRAM.
      *----------------------------------------------------------------
