      *----------------------------------------------------------------
      *--- MAIN PROGRAM -----------------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MPGM13.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77      PGM-NAME                PIC X(08).
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : MPGM13".
           DISPLAY " ".

           DISPLAY "HELLO".

           MOVE "SPGM13" TO PGM-NAME.
           CALL PGM-NAME.

           DISPLAY "I AM IN MAIN PROGRAM".

           DISPLAY " ".
           DISPLAY "THANK YOU FOR USING PROGRAM MPGM13".
           STOP RUN.
      *----------------------------------------------------------------
