      *----------------------------------------------------------------
      *--- STUDENT PROGRAM --------------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPGM05.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  STUDENT-RECORD.
           05     STUD-NAME     PIC A(15).
           05     FILLER        PIC X(01).
           05     MKS-01        PIC 9(03).
           05     FILLER        PIC X(01).
           05     MKS-02        PIC 9(03).
           05     FILLER        PIC X(01).
           05     MKS-03        PIC 9(03).
           05     FILLER        PIC X(01).
           05     TOTAL         PIC 9(03).
           05     FILLER        PIC X(01).
           05     PERCENT       PIC 9(03).
           05     FILLER        PIC X(01).
           05     RESULT        PIC A(04).
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : COBPGM05".
           DISPLAY " ".

           PERFORM STUDENT-PARA.

           DISPLAY "THANK YOU FOR USING COBPGM05".
           STOP RUN.
      *----------------------------------------------------------------
      *--- PROCESS STUDENT DETAILS ------------------------------------
      *----------------------------------------------------------------
       STUDENT-PARA.
           ACCEPT STUDENT-RECORD.

           COMPUTE TOTAL = MKS-01 + MKS-02 + MKS-03.
           COMPUTE PERCENT = TOTAL / 3.
           IF MKS-01 >= 35 AND MKS-02 >= 35 AND MKS-03 >= 35
              MOVE "PASS" TO RESULT
           ELSE
              MOVE "FAIL" TO RESULT
           END-IF.

           DISPLAY STUDENT-RECORD.
           DISPLAY " ".

           EXIT.
      *----------------------------------------------------------------
