      *---------------------------------------------------------------
      *--- JOIN THREE STRINGS INTO ONE STRING  -----------------------
      *---------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPGM12.
      *---------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *---------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01   NAME-RECORD.
            05     F-NAME        PIC X(10).
            05     FILLER        PIC X(01).
            05     M-NAME        PIC X(10).
            05     FILLER        PIC X(01).
            05     L-NAME        PIC X(10).
            05     FILLER        PIC X(01).
            05     FULL-NAME     PIC X(30).
      *---------------------------------------------------------------
       PROCEDURE DIVISION.
      *---------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ---------------------------------
      *---------------------------------------------------------------
       0000-MAIN-PARA.
            DISPLAY "WELCOME TO MY PROGRAM : COBPGM12".
            DISPLAY " ".

            ACCEPT NAME-RECORD.

            STRING L-NAME DELIMITED BY " "
                   "-"    DELIMITED BY SIZE
                   F-NAME DELIMITED BY " "
                   "-"    DELIMITED BY SIZE
                   M-NAME DELIMITED BY " "
              INTO FULL-NAME.

            DISPLAY NAME-RECORD.

            DISPLAY " ".
            DISPLAY "THANK YOU FOR USING PROGRAM COBPGM12".

            STOP RUN.
      *---------------------------------------------------------------
