      *----------------------------------------------------------------
      *--- HOW TO HANDLE DECIMAL POINT ? ------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPGM16.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01    NUMBER-RECORD.
             05       NUM-1      PIC  9(04).9(02).
             05       FILLER     PIC  X(01).
             05       NUM-2      PIC  9(04).9(02).
             05       FILLER     PIC  X(01).
             05       RESULT     PIC  9(05).9(02).

       77             CTR        PIC  9(01)    VALUE 1.
       77             NUM-1-V    PIC  9(04)V9(02).
       77             NUM-2-V    PIC  9(04)V9(02).
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : COBPGM16".
           DISPLAY " ".

           PERFORM 1000-ADD-PARA UNTIL CTR = 6.

           DISPLAY " ".
           DISPLAY "THANK YOU FOR USING PROGRAM COBPGM16".
           STOP RUN.
      *----------------------------------------------------------------
      *--- ADD TWO NUMBER AND DISPLAY THE SUM -------------------------
      *----------------------------------------------------------------
       1000-ADD-PARA.
           ACCEPT NUMBER-RECORD.

           MOVE NUM-1(1:4) TO NUM-1-V(1:4).
           MOVE NUM-1(6:2) TO NUM-1-V(5:2).

           MOVE NUM-2(1:4) TO NUM-2-V(1:4).
           MOVE NUM-2(6:2) TO NUM-2-V(5:2).

           COMPUTE RESULT = NUM-1-V + NUM-2-V.

           DISPLAY NUMBER-RECORD.
           COMPUTE CTR = CTR + 1.
           EXIT.
      *----------------------------------------------------------------
