      *----------------------------------------------------------------
      *--- STUDENT PROGRAM --------------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPGM04.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  STUDENT-RECORD.
           05     STUD-NAME     PIC A(15).
           05     FILLER        PIC X(01).
           05     MKS-01        PIC 9(03).
           05     FILLER        PIC X(01).
           05     MKS-02        PIC 9(03).
           05     FILLER        PIC X(01).
           05     MKS-03        PIC 9(03).
           05     FILLER        PIC X(01).
           05     TOTAL         PIC 9(03).
           05     FILLER        PIC X(01).
           05     PERCENT       PIC 9(03).
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : COBPGM04".
           DISPLAY " ".

           ACCEPT STUDENT-RECORD.

           COMPUTE TOTAL = MKS-01 + MKS-02 + MKS-03.
           COMPUTE PERCENT = TOTAL / 3.

           DISPLAY STUDENT-RECORD.
           DISPLAY " ".

           DISPLAY "THANK YOU FOR USING COBPGM04".
           STOP RUN.
      *----------------------------------------------------------------
