      *----------------------------------------------------------------
      *--- EMPLOYEE PROGRAM -------------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPGM20.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01   EMPLOYEE-RECORD.
            05      EMP-NO       PIC 9(04).
            05      FILLER       PIC X(01).
            05      EMP-NAME     PIC X(15).
            05      FILLER       PIC X(01).
            05      BASIC-SAL    PIC 9(06).9(02).
            05      FILLER       PIC X(01).
            05      DA           PIC 9(06).9(02).
            05      FILLER       PIC X(01).
            05      HRA          PIC 9(06).9(02).
            05      FILLER       PIC X(01).
            05      GROSS        PIC 9(07).9(02).
            05      FILLER       PIC X(01).
            05      REMARKS      PIC X(10).

       77           CTR          PIC  9(01)    VALUE 1.
       77           BASIC-SAL-V  PIC  9(06)V9(02).
       77           DA-V         PIC  9(06)V9(02).
       77           HRA-V        PIC  9(06)V9(02).
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : COBPGM20".
           DISPLAY " ".

           PERFORM 1000-EMPLOYEE-PARA UNTIL CTR = 8.

           DISPLAY " ".
           DISPLAY "THANK YOU FOR USING PROGRAM COBPGM20".
           STOP RUN.
      *----------------------------------------------------------------
      *--- PROCESS EMPLOYEE DETAILS -----------------------------------
      *----------------------------------------------------------------
       1000-EMPLOYEE-PARA.
           PERFORM 1100-ACCEPT-PARA.
           PERFORM 1200-VALIDATE-PARA.
           PERFORM 1300-CALCULATE-PARA.
           PERFORM 1400-DISPLAY-PARA.
           COMPUTE CTR = CTR + 1.
           EXIT.
      *----------------------------------------------------------------
      *--- INPUT   EMPLOYEE DETAILS -----------------------------------
      *----------------------------------------------------------------
       1100-ACCEPT-PARA.
           ACCEPT EMPLOYEE-RECORD.
           MOVE BASIC-SAL(1:6)    TO BASIC-SAL-V(1:6).
           MOVE BASIC-SAL(8:2)    TO BASIC-SAL-V(7:2).
           EXIT.
      *----------------------------------------------------------------
      *--- VALIDATE THE INPUT DATA ------------------------------------
      *----------------------------------------------------------------
       1200-VALIDATE-PARA.
           IF EMP-NO = 0 OR EMP-NAME = SPACES OR BASIC-SAL-V = 0
              MOVE "INVALID" TO REMARKS
           ELSE
              IF EMP-NO IS NOT NUMERIC OR BASIC-SAL-V IS NOT NUMERIC
                 MOVE "INVALID" TO REMARKS
              ELSE
                 MOVE "VALID" TO REMARKS
              END-IF
           END-IF.
           EXIT.
      *----------------------------------------------------------------
      *--- CALCULATE DA, HRA, GROSS -----------------------------------
      *----------------------------------------------------------------
       1300-CALCULATE-PARA.
           IF REMARKS =  "VALID"
              COMPUTE DA-V = 0.4 * BASIC-SAL-V
              COMPUTE HRA-V = 0.15 * BASIC-SAL-V
              COMPUTE GROSS = BASIC-SAL-V + DA-V + HRA-V
           END-IF.
           EXIT.
      *----------------------------------------------------------------
      *--- DISPLAY THE OUTPUT -----------------------------------------
      *----------------------------------------------------------------
       1400-DISPLAY-PARA.
           MOVE DA-V TO DA.
           MOVE HRA-V TO HRA.
           DISPLAY EMPLOYEE-RECORD.
           EXIT.
      *----------------------------------------------------------------
