      *----------------------------------------------------------------
      *--- PERFORM ... UNTIL ------------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPGM19.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77             CTR        PIC  9(01)    VALUE 1.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : COBPGM19".
           DISPLAY " ".

           PERFORM 1000-DISPLAY-PARA UNTIL CTR = 6.

           DISPLAY " ".
           DISPLAY "THANK YOU FOR USING PROGRAM COBPGM19".
           STOP RUN.
      *----------------------------------------------------------------
      *--- DISPLAY A MESSAGE ------------------------------------------
      *----------------------------------------------------------------
       1000-DISPLAY-PARA.
           DISPLAY "HELLO ", CTR.
           COMPUTE CTR = CTR + 1.
           EXIT.
      *----------------------------------------------------------------
