      *----------------------------------------------------------------
      *--- COPY RECORDS FROM PS FILE TO TABLE -------------------------
      *--- HANDLE VARCHAR COLUMN IN A PROGRAM -------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASGN01.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PS-FILE ASSIGN TO DD01
           ORGANIZATION IS SEQUENTIAL
           FILE STATUS IS FS-PS.
      *----------------------------------------------------------------
       DATA DIVISION.

       FILE SECTION.
       FD  PS-FILE
           LABEL RECORDS ARE STANDARD
           RECORDING MODE IS F.
       01  PS-FILE-RB.
           05       FILLER        PIC X(80).

       WORKING-STORAGE SECTION.

       01  RESULT-WS.
           05       ROLL-NO-WS    PIC 9(04).
           05       FILLER        PIC X(01).
           05       STUD-NAME-WS  PIC X(15).
           05       FILLER        PIC X(01).
           05       MOBILE-NO-WS  PIC 9(10).
           05       FILLER        PIC X(01).
           05       MKS-1-WS      PIC 9(03).
           05       FILLER        PIC X(01).
           05       MKS-2-WS      PIC 9(03).
           05       FILLER        PIC X(01).
           05       MKS-3-WS      PIC 9(03).

       77            FS-PS         PIC X(02)      VALUE SPACES.
       77            TOTAL-RECS    PIC 9(02)      VALUE 0.
       77            VALID-RECS    PIC 9(02)      VALUE 0.
       77            INVALID-RECS  PIC 9(02)      VALUE 0.
       77            RECORD-STATUS PIC X(10)      VALUE SPACES.
       77            LEN-1         PIC 9(02)      VALUE 0.
       77            LEN-2         PIC 9(02)      VALUE 0.
       77            TOTAL         PIC 9(04)      VALUE 0.
       77            PERCENT       PIC 9(05)      VALUE 0.
       77            CLAS          PIC X(04)      VALUE SPACES.
      *-- PLUG-IN DCLGEN MEMBER : TABLE STRUCTURE + HOST-VAR DECL. ----
           EXEC SQL
                INCLUDE RES194
           END-EXEC.

      *-- PLUG-IN SQLCA  MEMBER : SQLCODE VARIABLE DECLARATION --------
           EXEC SQL
                INCLUDE SQLCA
           END-EXEC.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO PROGRAM : ASGN01".
           DISPLAY " ".

      *--- EMPTY THE TABLE BEFORE EXECUTING THE LOGIC -----------------
           EXEC SQL
                DELETE FROM RES194
           END-EXEC.
           EXEC SQL
                COMMIT
           END-EXEC.
      *----------------------------------------------------------------

           PERFORM 1000-OPEN-PARA.

           READ PS-FILE INTO RESULT-WS.
           PERFORM 2000-RESULT-PARA UNTIL FS-PS = "10".

           PERFORM 3000-CLOSE-PARA.

           PERFORM 4000-SHOW-STATS-PARA.

           DISPLAY "THANK YOU FOR USING PROGRAM ASGN01".
           STOP RUN.
      *----------------------------------------------------------------
      *--- OPEN THE INPUT FILE  ---------------------------------------
      *----------------------------------------------------------------
       1000-OPEN-PARA.
           OPEN INPUT PS-FILE.
           DISPLAY "PS FILE OPEN STATUS : ", FS-PS.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS EMPLOYEE DETAILS -----------------------------------
      *----------------------------------------------------------------
       2000-RESULT-PARA.
           PERFORM 2100-VALIDATE-PARA.
           PERFORM 2200-PROCESS-PARA.
           PERFORM 2300-INSERT-PARA.
           ADD 1 TO TOTAL-RECS.
           READ PS-FILE INTO RESULT-WS.
           EXIT.
      *----------------------------------------------------------------
      *--- VALIDATE THE INPUT RECORD ----------------------------------
      *----------------------------------------------------------------
       2100-VALIDATE-PARA.
           EVALUATE TRUE
               WHEN ROLL-NO-WS = 0 OR STUD-NAME-WS = SPACES OR
                    MKS-1-WS = 0  OR MKS-2-WS = 0 OR
                    MKS-3-WS = 0  OR MOBILE-NO-WS = 0
                            DISPLAY "V1 -> ", RESULT-WS
                            MOVE "INVALID" TO RECORD-STATUS
                            ADD 1 TO INVALID-RECS
               WHEN ROLL-NO-WS    IS NOT NUMERIC OR
                    MKS-1-WS     IS NOT NUMERIC OR
                    MKS-2-WS     IS NOT NUMERIC OR
                    MKS-3-WS     IS NOT NUMERIC
                            DISPLAY "V2 -> ", RESULT-WS
                            MOVE "INVALID" TO RECORD-STATUS
                            ADD 1 TO INVALID-RECS
               WHEN MKS-1-WS < 1 OR MKS-1-WS  > 100 OR
                    MKS-2-WS < 1 OR MKS-2-WS  > 100 OR
                    MKS-3-WS < 1 OR MKS-2-WS  > 100
                            DISPLAY "V3 -> ", RESULT-WS
                            MOVE "INVALID" TO RECORD-STATUS
                            ADD 1 TO INVALID-RECS
               WHEN OTHER
                            MOVE "VALID" TO RECORD-STATUS
           END-EVALUATE.
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS THE RESULT RECORD --------------------------------
      *----------------------------------------------------------------
       2200-PROCESS-PARA.
           IF RECORD-STATUS = "VALID"
              MOVE ROLL-NO-WS      TO   HV-ROLL-NO

              MOVE STUD-NAME-WS    TO   HV-STUD-NAME-TEXT

              MOVE 0 TO LEN-1
              MOVE 0 TO LEN-2
              MOVE LENGTH OF STUD-NAME-WS TO LEN-1
              INSPECT FUNCTION REVERSE(STUD-NAME-WS) TALLYING LEN-2
                                   FOR LEADING "-"
              COMPUTE HV-STUD-NAME-LEN = LEN-1 - LEN-2
      *----------------------------------------------------------------
              MOVE TOTAL          TO   HV-TOTAL
              MOVE PERCENT        TO   HV-PERCENT
              MOVE MOBILE-NO-WS   TO   HV-MOBILE-NO
              MOVE CLAS           TO   HV-CLAS

              COMPUTE HV-TOTAL   =   MKS-1-WS + MKS-2-WS + MKS-3-WS
              COMPUTE HV-PERCENT = HV-TOTAL / 3
      *----------------------------------------------------------------
               EVALUATE TRUE
                    WHEN MKS-1-WS  >= 35 AND MKS-2-WS >= 35 AND
                    MKS-3-WS  >= 35
                         MOVE "PASS" TO HV-CLAS
                    WHEN OTHER
                         MOVE "FAIL" TO HV-CLAS
               END-EVALUATE
           END-IF.
           EXIT.
      *----------------------------------------------------------------
      *--- INSERT THE ROW IN THE TABLE --------------------------------
      *----------------------------------------------------------------
       2300-INSERT-PARA.
           IF RECORD-STATUS = "VALID"
              EXEC SQL
                   INSERT INTO RES194 VALUES(:HV-ROLL-NO,
                                             :HV-STUD-NAME,
                                             :HV-MOBILE-NO,
                                             :HV-TOTAL,
                                             :HV-PERCENT,
                                             :HV-CLAS)

              END-EXEC
              EVALUATE TRUE
                   WHEN SQLCODE = 0
                        DISPLAY HV-ROLL-NO, " HAS BEEN INSERTED"
                        ADD 1 TO VALID-RECS
                   WHEN SQLCODE = -803
                        DISPLAY RESULT-WS
                        DISPLAY HV-ROLL-NO, " ALREADY EXISTS IN TABLE"
                        ADD 1 TO INVALID-RECS
                   WHEN OTHER
                        DISPLAY RESULT-WS
                        DISPLAY HV-ROLL-NO, " INSERT ERROR : ",SQLCODE
                        ADD 1 TO INVALID-RECS
              END-EVALUATE
           END-IF.
           EXIT.
      *----------------------------------------------------------------
      *--- CLOSE THE INPUT FILE ---------------------------------------
      *----------------------------------------------------------------
       3000-CLOSE-PARA.
           DISPLAY " ".
           CLOSE PS-FILE.
           DISPLAY "PS FILE CLOSE STATUS : ", FS-PS.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- DISPLAY THE STATISTICS -------------------------------------
      *----------------------------------------------------------------
       4000-SHOW-STATS-PARA.
           DISPLAY "TOTAL RECORDS PROCESSED : ", TOTAL-RECS.
           DISPLAY "TOTAL VALID RECORDS     : ", VALID-RECS.
           DISPLAY "TOTAL INVALID RECORDS   : ", INVALID-RECS.
           EXIT.
      *----------------------------------------------------------------
