      *----------------------------------------------------------------
      *--- COPY ROWS FROM TABLE TO TABLE ------------------------------
      *--- HANDLE NULL COLUMN IN A PROGRAM ----------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASGN05.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       77  MOBILE-NO-IV-IN       PIC S9(04) COMP.
       77  MOBILE-NO-IV-OU       PIC S9(04) COMP.

           EXEC SQL
                INCLUDE STUDIN
           END-EXEC.

           EXEC SQL
                INCLUDE STUDOU
           END-EXEC.

           EXEC SQL
                INCLUDE SQLCA
           END-EXEC.

           EXEC SQL
                DECLARE CUR01 CURSOR FOR SELECT ROLL_NO,
                                                STUD_NAME,
                                                MOBILE_NO,
                                                PERCENTAGE
                                           FROM STUD_INPUT
           END-EXEC.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGICS STARTS HERE ---------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : ASGN05".
           DISPLAY " ".

           EXEC SQL
                DELETE FROM STUD_OUTPUT
           END-EXEC.
           EXEC SQL
                COMMIT
           END-EXEC.

           PERFORM 1000-OPEN-PARA.

           PERFORM 2000-FETCH-PARA.
           PERFORM 3000-COPY-PARA UNTIL SQLCODE = 100.

           PERFORM 4000-CLOSE-PARA.

           DISPLAY "THANK YOU FOR USING PROGRAM ASGN05".
           GOBACK.
      *----------------------------------------------------------------
      *--- OPEN THE CURSOR --------------------------------------------
      *----------------------------------------------------------------
       1000-OPEN-PARA.
           EXEC SQL
                OPEN CUR01
           END-EXEC.
           DISPLAY "CUR01 CURSOR OPEN STATUS : ", SQLCODE.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- FETCH THE ROW FROM INPUT TABLE -----------------------------
      *----------------------------------------------------------------
       2000-FETCH-PARA.
           EXEC SQL
                FETCH CUR01 INTO :HV-IN-ROLL-NO,
                                 :HV-IN-STUD-NAME,
                                 :HV-IN-MOBILE-NO:MOBILE-NO-IV-IN,
                                 :HV-IN-PERCENTAGE
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS THE ROWS OF INPUT TABLE ----------------------------
      *----------------------------------------------------------------
       3000-COPY-PARA.
           PERFORM 3100-PROCESS-PARA.
           PERFORM 2000-FETCH-PARA.
           EXIT.
      *----------------------------------------------------------------
      *--- COPY ROWS FROM INPUT TABLE TO OUTPUT TABLE -----------------
      *----------------------------------------------------------------
       3100-PROCESS-PARA.
           MOVE HV-IN-ROLL-NO    TO   HV-OU-ROLL-NO.
           MOVE HV-IN-STUD-NAME  TO   HV-OU-STUD-NAME.
           MOVE HV-IN-PERCENTAGE TO   HV-OU-PERCENTAGE.
      *--- CODE TO INSERT NULL VALUE IN A NULL COLUMN -----------------
           EVALUATE TRUE
               WHEN MOBILE-NO-IV-IN = 0
                    MOVE HV-IN-MOBILE-NO TO HV-OU-MOBILE-NO
                    MOVE 0            TO MOBILE-NO-IV-OU
               WHEN MOBILE-NO-IV-IN = -1
                    MOVE -1           TO MOBILE-NO-IV-OU
           END-EVALUATE.
      *----------------------------------------------------------------

           EXEC SQL
             INSERT INTO STUD_OUTPUT VALUES(:HV-OU-ROLL-NO,
                                            :HV-OU-STUD-NAME,
                                   :HV-OU-MOBILE-NO:MOBILE-NO-IV-OU,
                                            :HV-OU-PERCENTAGE)
           END-EXEC.
           EVALUATE TRUE
                WHEN SQLCODE = 0
                     DISPLAY HV-OU-ROLL-NO, " HAS BEEN COPIED"
                WHEN SQLCODE = -803
                     DISPLAY HV-OU-ROLL-NO, " ALREADY EXISTS"
                WHEN OTHER
                     DISPLAY HV-OU-ROLL-NO, " INSERT ERROR : ", SQLCODE
           END-EVALUATE.
           EXIT.
      *----------------------------------------------------------------
      *--- CLOSE THE CURSOR -------------------------------------------
      *----------------------------------------------------------------
       4000-CLOSE-PARA.
           EXEC SQL
                CLOSE CUR01
           END-EXEC.
           DISPLAY " ".
           DISPLAY "CUR01 CURSOR CLOSE STATUS : ", SQLCODE.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
