      *----------------------------------------------------------------
      *--- SEARCH A RECORD IN THE TABLE  ------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2PGM03.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.

       WORKING-STORAGE SECTION.

       77      RECORD-STATUS      PIC X(10)      VALUE SPACES.
       77      EMP-NO-WS          PIC 9(04)      VALUE 0.
       77      SALARY-EDIT        PIC ZZZ,ZZ9.99.

      *-- PLUG-IN DCLGEN MEMBER : TABLE STRUCTURE + HOST-VAR DECL. ----
           EXEC SQL
                INCLUDE EMP194
           END-EXEC.

      *-- PLUG-IN SQLCA  MEMBER : SQLCODE VARIABLE DECLARATION --------
           EXEC SQL
                INCLUDE SQLCA
           END-EXEC.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO PROGRAM : DB2PGM03".
           DISPLAY " ".

           ACCEPT EMP-NO-WS.

           PERFORM 1000-VALIDATE-PARA.
           PERFORM 2000-SEARCH-PARA.

           DISPLAY "THANK YOU FOR USING PROGRAM DB2PGM03".
           GOBACK.
      *----------------------------------------------------------------
      *--- VALIDATE THE EMPLOYEE NUMBER -------------------------------
      *----------------------------------------------------------------
       1000-VALIDATE-PARA.
           EVALUATE TRUE
              WHEN EMP-NO-WS = 0
                   MOVE "INVALID" TO RECORD-STATUS
                   DISPLAY "EMPLOYEE NUMBER IS HAVING ZERO VALUE"
              WHEN EMP-NO-WS IS NOT NUMERIC
                   MOVE "INVALID" TO RECORD-STATUS
                   DISPLAY "EMPLOYEE NUMBER CONTAINS NON-NUMERIC DATA"
              WHEN OTHER
                   MOVE "VALID" TO RECORD-STATUS
           END-EVALUATE.
           EXIT.
      *----------------------------------------------------------------
      *--- SEARCH EMPLOYEE NUMBER IN TABLE ----------------------------
      *----------------------------------------------------------------
       2000-SEARCH-PARA.
           IF RECORD-STATUS = "VALID"
              MOVE EMP-NO-WS TO HV-EMP-NO
              EXEC SQL
                   SELECT EMP_NAME,
                          PROJECT,
                          JOIN_DATE,
                          SALARY
                     INTO :HV-EMP-NAME,
                          :HV-PROJECT,
                          :HV-JOIN-DATE,
                          :HV-SALARY
                     FROM EMP194
                    WHERE EMP_NO = :HV-EMP-NO
              END-EXEC
              EVALUATE TRUE
                   WHEN SQLCODE = 0
                        DISPLAY "EMPLOYEE NO       : ", HV-EMP-NO
                        DISPLAY "EMPLOYEE NAME     : ", HV-EMP-NAME-TEXT
                        DISPLAY "EMPLOYEE NAME LEN : ", HV-EMP-NAME-LEN
                        DISPLAY "PROJECT           : ", HV-PROJECT-TEXT
                        DISPLAY "PROJECT LEN       : ", HV-PROJECT-LEN
                        DISPLAY "JOIN DATE         : ", HV-JOIN-DATE
                        MOVE HV-SALARY TO SALARY-EDIT
                        DISPLAY "SALARY            : ", SALARY-EDIT
                        DISPLAY " "
                   WHEN SQLCODE = 100
                        DISPLAY HV-EMP-NO, " NOT FOUND IN TABLE"
                        DISPLAY " "
              END-EVALUATE
           END-IF.
           EXIT.
