      *----------------------------------------------------------------
      *--- COPY RECORDS FROM PS FILE TO TABLE -------------------------
      *--- HANDLE VARCHAR COLUMN IN A PROGRAM -------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2PGM02.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PS-FILE ASSIGN TO DD01
           ORGANIZATION IS SEQUENTIAL
           FILE STATUS IS FS-PS.
      *----------------------------------------------------------------
       DATA DIVISION.

       FILE SECTION.
       FD  PS-FILE
           LABEL RECORDS ARE STANDARD
           RECORDING MODE IS F.
       01  PS-FILE-RB.
           05       FILLER        PIC X(80).

       WORKING-STORAGE SECTION.

       01  EMPLOYEE-WS.
           05       EMP-NO-WS     PIC 9(04).
           05       FILLER        PIC X(01).
           05       EMP-NAME-WS   PIC X(15).
           05       FILLER        PIC X(01).
           05       PROJECT-WS    PIC X(10).
           05       FILLER        PIC X(01).
           05       JOIN-DATE-WS  PIC X(10).
           05       FILLER        PIC X(01).
           05       BASIC-WS      PIC 9(06).
           05       FILLER        PIC X(01).
           05       ALLOWANCE-WS  PIC 9(05).

       77            FS-PS         PIC X(02)      VALUE SPACES.
       77            TOTAL-RECS    PIC 9(02)      VALUE 0.
       77            VALID-RECS    PIC 9(02)      VALUE 0.
       77            INVALID-RECS  PIC 9(02)      VALUE 0.
       77            RECORD-STATUS PIC X(10)      VALUE SPACES.
       77            LEN-1         PIC 9(02)      VALUE 0.
       77            LEN-2         PIC 9(02)      VALUE 0.

      *-- PLUG-IN DCLGEN MEMBER : TABLE STRUCTURE + HOST-VAR DECL. ----
           EXEC SQL
                INCLUDE EMP194
           END-EXEC.

      *-- PLUG-IN SQLCA  MEMBER : SQLCODE VARIABLE DECLARATION --------
           EXEC SQL
                INCLUDE SQLCA
           END-EXEC.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO PROGRAM : DB2PGM02".
           DISPLAY " ".

      *--- EMPTY THE TABLE BEFORE EXECUTING THE LOGIC -----------------
           EXEC SQL
                DELETE FROM EMP194
           END-EXEC.
           EXEC SQL
                COMMIT
           END-EXEC.
      *----------------------------------------------------------------

           PERFORM 1000-OPEN-PARA.

           READ PS-FILE INTO EMPLOYEE-WS.
           PERFORM 2000-EMPLOYEE-PARA UNTIL FS-PS = "10".

           PERFORM 3000-CLOSE-PARA.

           PERFORM 4000-SHOW-STATS-PARA.

           DISPLAY "THANK YOU FOR USING PROGRAM DB2PGM01".
           STOP RUN.
      *----------------------------------------------------------------
      *--- OPEN THE INPUT FILE  ---------------------------------------
      *----------------------------------------------------------------
       1000-OPEN-PARA.
           OPEN INPUT PS-FILE.
           DISPLAY "PS FILE OPEN STATUS : ", FS-PS.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS EMPLOYEE DETAILS -----------------------------------
      *----------------------------------------------------------------
       2000-EMPLOYEE-PARA.
           PERFORM 2100-VALIDATE-PARA.
           PERFORM 2200-PROCESS-PARA.
           PERFORM 2300-INSERT-PARA.
           ADD 1 TO TOTAL-RECS.
           READ PS-FILE INTO EMPLOYEE-WS.
           EXIT.
      *----------------------------------------------------------------
      *--- VALIDATE THE INPUT RECORD ----------------------------------
      *----------------------------------------------------------------
       2100-VALIDATE-PARA.
           EVALUATE TRUE
               WHEN EMP-NO-WS = 0 OR EMP-NAME-WS = SPACES OR
                    PROJECT-WS = SPACES OR JOIN-DATE-WS = SPACES OR
                    BASIC-WS = 0 OR ALLOWANCE-WS = 0
                            DISPLAY "V1 -> ", EMPLOYEE-WS
                            MOVE "INVALID" TO RECORD-STATUS
                            ADD 1 TO INVALID-RECS
               WHEN EMP-NO-WS    IS NOT NUMERIC OR
                    BASIC-WS     IS NOT NUMERIC OR
                    ALLOWANCE-WS IS NOT NUMERIC
                            DISPLAY "V2 -> ", EMPLOYEE-WS
                            MOVE "INVALID" TO RECORD-STATUS
                            ADD 1 TO INVALID-RECS
               WHEN PROJECT-WS NOT = "BANKING---" AND
                    PROJECT-WS NOT = "FINANCE---" AND
                    PROJECT-WS NOT = "RETAIL----"
                            DISPLAY "V3 -> ", EMPLOYEE-WS
                            MOVE "INVALID" TO RECORD-STATUS
                            ADD 1 TO INVALID-RECS
               WHEN OTHER
                            MOVE "VALID" TO RECORD-STATUS
           END-EVALUATE.
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS THE EMPLOYEE RECORD --------------------------------
      *----------------------------------------------------------------
       2200-PROCESS-PARA.
           IF RECORD-STATUS = "VALID"
              MOVE EMP-NO-WS      TO   HV-EMP-NO

      *--- CODE TO HANDLE A VARCHAR COLUMN : EMP-NAME -----------------
              MOVE EMP-NAME-WS    TO   HV-EMP-NAME-TEXT

              MOVE 0 TO LEN-1
              MOVE 0 TO LEN-2
              MOVE LENGTH OF EMP-NAME-WS TO LEN-1
              INSPECT FUNCTION REVERSE(EMP-NAME-WS) TALLYING LEN-2
                                   FOR LEADING "-"
              COMPUTE HV-EMP-NAME-LEN = LEN-1 - LEN-2
      *----------------------------------------------------------------

      *--- CODE TO HANDLE A VARCHAR COLUMN : PROJECT ------------------
              MOVE PROJECT-WS     TO   HV-PROJECT-TEXT

              MOVE 0 TO LEN-1
              MOVE 0 TO LEN-2
              MOVE LENGTH OF PROJECT-WS TO LEN-1
              INSPECT FUNCTION REVERSE(PROJECT-WS) TALLYING LEN-2
                                   FOR LEADING "-"
              COMPUTE HV-PROJECT-LEN = LEN-1 - LEN-2
      *----------------------------------------------------------------

              MOVE JOIN-DATE-WS   TO   HV-JOIN-DATE
              COMPUTE HV-SALARY   =    BASIC-WS + ALLOWANCE-WS
           END-IF.
           EXIT.
      *----------------------------------------------------------------
      *--- INSERT THE ROW IN THE TABLE --------------------------------
      *----------------------------------------------------------------
       2300-INSERT-PARA.
           IF RECORD-STATUS = "VALID"
              EXEC SQL
                   INSERT INTO EMP194 VALUES(:HV-EMP-NO,
                                             :HV-EMP-NAME,
                                             :HV-PROJECT,
                                             :HV-JOIN-DATE,
                                             :HV-SALARY,
                                             CURRENT TIMESTAMP)
              END-EXEC
              EVALUATE TRUE
                   WHEN SQLCODE = 0
                        DISPLAY HV-EMP-NO, " HAS BEEN INSERTED"
                        ADD 1 TO VALID-RECS
                   WHEN SQLCODE = -803
                        DISPLAY EMPLOYEE-WS
                        DISPLAY HV-EMP-NO, " ALREADY EXISTS IN TABLE"
                        ADD 1 TO INVALID-RECS
                   WHEN OTHER
                        DISPLAY EMPLOYEE-WS
                        DISPLAY HV-EMP-NO, " INSERT ERROR : ", SQLCODE
                        ADD 1 TO INVALID-RECS
              END-EVALUATE
           END-IF.
           EXIT.
      *----------------------------------------------------------------
      *--- CLOSE THE INPUT FILE ---------------------------------------
      *----------------------------------------------------------------
       3000-CLOSE-PARA.
           DISPLAY " ".
           CLOSE PS-FILE.
           DISPLAY "PS FILE CLOSE STATUS : ", FS-PS.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- DISPLAY THE STATISTICS -------------------------------------
      *----------------------------------------------------------------
       4000-SHOW-STATS-PARA.
           DISPLAY "TOTAL RECORDS PROCESSED : ", TOTAL-RECS.
           DISPLAY "TOTAL VALID RECORDS     : ", VALID-RECS.
           DISPLAY "TOTAL INVALID RECORDS   : ", INVALID-RECS.
           EXIT.
      *----------------------------------------------------------------
