//OZA194J     JOB       '123-WIPRO','RAKESH',NOTIFY=&SYSUID,TIME=(2,30)
//*--------------------------------------------------------------------
//*----- SORT RECORDS AND FILTER COLUMNS OR FORMAT RECORDS IN OUTPUT--
//*--------------------------------------------------------------------
//STEP01      EXEC       PGM=SORT
//SYSOUT      DD         SYSOUT=*
//SORTIN      DD         DSN=OZA194.WIPRO.EMPLOYEE.DATA,DISP=OLD
//SORTWK01    DD         UNIT=SYSDA,SPACE=(TRK,(1,1))
//SORTOUT     DD         SYSOUT=*
//*-----SORD CARD-----------------------------------------------------
//SYSIN       DD         *
 SORT FIELDS=(1,4,CH,D)
 OUTREC FIELDS=(27,10,C' ',6,20,C' ',36,6,C' ',1,4)
/*
//*--------------------------------------------------------------------
