//OZA194J    JOB   '123-WIPRO','MADHAV',NOTIFY=&SYSUID,TIME=(2,30)
//* ------------------------------------------------------------------
//* --- INSTREAM PROCEDURE : CODING > 1 EXEC COMMANDS IN 1 PROCEDURE -
//* ------------------------------------------------------------------
//SHOWDATA   PROC   FNAME1='OZA194.WIPRO.EMPLOYEE.DATA',
// FNAME2='OZA194.WIPRO.EMPLOYEE.DATA',
// FNAME3='OZA194.WIPRO.EMPLOYEE.DATA'
//STEP01     EXEC   PGM=IEBGENER
//SYSPRINT   DD     SYSOUT=*
//SYSUT1     DD     DSN=&FNAME1,DISP=OLD
//SYSUT2     DD     SYSOUT=*
//SYSIN      DD     DUMMY
//* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//STEP02     EXEC   PGM=IEBGENER
//SYSPRINT   DD     SYSOUT=*
//SYSUT1     DD     DSN=&FNAME2,DISP=OLD
//SYSUT2     DD     SYSOUT=*
//SYSIN      DD     DUMMY
//* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//STEP03     EXEC   PGM=IEBGENER
//SYSPRINT   DD     SYSOUT=*
//SYSUT1     DD     DSN=&FNAME3,DISP=OLD
//SYSUT2     DD     SYSOUT=*
//SYSIN      DD     DUMMY
//           PEND
//* ------------------------------------------------------------------
//* --- MAIN CODE ----------------------------------------------------
//* ------------------------------------------------------------------
//STEPA      EXEC   PROC=SHOWDATA,
// FNAME1='OZA194.WIPRO.CUSTOMER.DATA',
// FNAME2='OZA194.WIPRO.EMPLOYEE.DATA',
// FNAME3='OZA194.WIPRO.CUSTOMER.DATA'
//* ------------------------------------------------------------------
