//OZA194J    JOB       '123-WIPRO','RAKESH',NOTIFY=&SYSUID,TIME=(2,30)
//*--------------------------------------------------------------------
//*----- DISPLAY CONTENT IN SPOOL--------------------------------------
//*--------------------------------------------------------------------
//STEPO1     EXEC      PGM=IEBGENER
//SYSPRINT   DD        SYSOUT=*
//SYSUT1     DD        DSN=OZA194.WIPRO.EMPLOYEE.DATA,DISP=OLD
//SYSUT2     DD        SYSOUT=*
//SYSIN      DD        DUMMY
//*--------------------------------------------------------------------
