//OZA194J     JOB      '123-WIPRO','MADHAV',NOTIFY=&SYSUID,TIME=(2,30),
// MSGLEVEL=(0,1)
//*-------------------------------------------------------------------
//*------- ALLOCATE A DATASET ----------------------------------------
//*-------------------------------------------------------------------
//STEP01      EXEC   PGM=IEFBR14
//DD01        DD     DSN=OZA194.USERID.AGENT.FILE.SORTED,
// UNIT=SYSDA,
// DISP=(NEW,CATLG),
// SPACE=(TRK,(10,7)),
// DCB=(DSORG=PS,LRECL=80,RECFM=FB,BLKSIZE=800)
//*-------------------------------------------------------------------
