//OZA194V    JOB  '123-WIPRO','MADHAV',TIME=(2,30),NOTIFY=&SYSUID
//* -------------------------------------------------------------------
//* --- RENAME A CLUSTER ----------------------------------------------
//* -------------------------------------------------------------------
//STEP01     EXEC PGM=IDCAMS
//SYSPRINT   DD   SYSOUT=*
//SYSIN      DD   *
    ALTER  OZA194.PAYROLL.KSDS.CLUSTER -
                 NEWNAME(OZA194.WIPRO.PAYROLL.KSDS.CLUSTER)

    ALTER  OZA194.PAYROLL.KSDS.INDEX -
                 NEWNAME(OZA194.WIPRO.PAYROLL.KSDS.INDEX)

    ALTER  OZA194.PAYROLL.KSDS.DATA -
                 NEWNAME(OZA194.WIPRO.PAYROLL.KSDS.DATA)
/*
