//OZA194V    JOB  '123-WIPRO','MADHAV',TIME=(2,30),NOTIFY=&SYSUID
//* -------------------------------------------------------------------
//* --- SORT ON EMPNO AND ELIMINATE DUPLICATES ------------------------
//* -------------------------------------------------------------------
//STEP01     EXEC PGM=SORT
//SYSOUT     DD   SYSOUT=*
//SORTIN     DD   DSN=OZA194.WIPRO.FILE01,DISP=OLD
//SORTWK01   DD   UNIT=SYSDA,SPACE=(TRK,(1,1))
//SORTOUT    DD   DSN=OZA194.WIPRO.EMPLOYEE.DATA,DISP=OLD
//SYSIN      DD   *
 SORT FIELDS=(1,4,CH,A)
 SUM FIELDS=NONE
/*
//* -------------------------------------------------------------------
//* --- COPY DATA TO KSDS CLUSTER -------------------------------------
//* -------------------------------------------------------------------
//STEP02     EXEC PGM=IDCAMS
//SYSPRINT   DD   SYSOUT=*
//DD01       DD   DSN=OZA194.WIPRO.EMPLOYEE.DATA,DISP=OLD
//DD02       DD   DSN=OZA194.WIPRO.EMP.KSDS.CLUSTER,DISP=OLD
//SYSIN      DD   *
    REPRO INFILE(DD01)  OUTFILE(DD02) REUSE
/*
//* -------------------------------------------------------------------
//* --- DISPLAY KSDS CLUSTER IN SPOOL ---------------------------------
//* -------------------------------------------------------------------
//STEP03     EXEC PGM=IDCAMS
//SYSPRINT   DD   SYSOUT=*
//DD01       DD   DSN=OZA194.WIPRO.EMP.KSDS.CLUSTER,DISP=OLD
//DD02       DD   SYSOUT=*
//SYSIN      DD   *
 REPRO INFILE(DD01) OUTFILE(DD02) REUSE
/*
//* -------------------------------------------------------------------
