//OZA194V    JOB  '123-WIPRO','MADHAV',TIME=(2,30),NOTIFY=&SYSUID
//* -------------------------------------------------------------------
//* --- COPY DATA TO KSDS CLUSTER -------------------------------------
//* -------------------------------------------------------------------
//STEP01     EXEC PGM=IDCAMS
//SYSPRINT   DD   SYSOUT=*
//DD01       DD   DSN=OZA194.WIPRO.FILE01,DISP=OLD
//DD02       DD   DSN=OZA194.WIPRO.EMP.KSDS.CLUSTER,DISP=OLD
//SYSIN      DD   *
    REPRO INFILE(DD01)  OUTFILE(DD02) REPLACE
/*
//* -------------------------------------------------------------------
