//OZA194V    JOB  '123-WIPRO','MADHAV',TIME=(2,30),NOTIFY=&SYSUID,
// RESTART=STEP01
//* -------------------------------------------------------------------
//* --- COPY DATA TO KSDS CLUSTER -------------------------------------
//* -------------------------------------------------------------------
//STEP01     EXEC PGM=IDCAMS
//SYSPRINT   DD   SYSOUT=*
//DD01       DD   DSN=OZA194.WIPRO.INPUT.FILE02,DISP=OLD
//DD02       DD   DSN=OZA194.WIPRO.STUDENT.KSDS.CLUSTER,DISP=OLD
//SYSIN      DD   *
    REPRO INFILE(DD01)  OUTFILE(DD02) REUSE
/*
//* -------------------------------------------------------------------
//* --- DISPLAY KSDS CLUSTER IN SPOOL ---------------------------------
//* -------------------------------------------------------------------
//STEP02     EXEC PGM=IDCAMS
//SYSPRINT   DD   SYSOUT=*
//DD01       DD   DSN=OZA194.WIPRO.STUDENT.KSDS.CLUSTER,DISP=OLD
//DD02       DD   SYSOUT=*
//SYSIN      DD   *
 REPRO INFILE(DD01) OUTFILE(DD02) REUSE
/*
//* -------------------------------------------------------------------
