//OZA194V    JOB  '123-WIPRO','MADHAV',TIME=(2,30),NOTIFY=&SYSUID
//* -------------------------------------------------------------------
//* --- DEFINE KSDS CLUSTER -------------------------------------------
//* -------------------------------------------------------------------
//STEP01     EXEC PGM=IDCAMS
//SYSPRINT   DD   SYSOUT=*
//SYSIN      DD   *
    DELETE OZA194.WIPRO.BANKING.KSDS.CLUSTER

    DEFINE CLUSTER(NAME(OZA194.WIPRO.BANKING.KSDS.CLUSTER) -
                   VOLUMES(USR002) -
                   INDEXED -
                   TRACKS(10,7) -
                   KEYS(4,0) -
                   RECORDSIZE(150 150) -
                   REUSE) -
             INDEX(NAME(OZA194.WIPRO.BANKING.KSDS.INDEX)) -
              DATA(NAME(OZA194.WIPRO.BANKING.KSDS.DATA))
/*
