      *----------------------------------------------------------------
      *--- REPORT PROGRAM ---------------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. REPORT09.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

      *--- OUTPUT FILE ENTRIES ----------------------------------------
           SELECT OUT-FILE ASSIGN TO DD01
           ORGANIZATION IS SEQUENTIAL
           FILE STATUS IS FS-OUT.
      *----------------------------------------------------------------
       DATA DIVISION.

       FILE SECTION.
      *--- OUTPUT  FILE ENTRIES ----------------------------------------
       FD  OUT-FILE
           LABEL RECORDS ARE OMITTED
           RECORDING MODE IS F.
       01  OUT-FILE-RB.
           05         FILLER          PIC X(80).

       WORKING-STORAGE SECTION.

       01  DATE-TIME-RECORD-REP.
           05         FILLER          PIC X(01)     VALUE SPACES.
           05         FILLER          PIC X(07)     VALUE "DATE : ".
           05         DATE-REP        PIC X(10)     VALUE SPACES.
           05         FILLER          PIC X(39)     VALUE SPACES.
           05         FILLER          PIC X(07)     VALUE "TIME : ".
           05         TIME-REP        PIC X(08)     VALUE SPACES.

       01  HEADING-RECORD-REP.
           05         FILLER        PIC X(32)     VALUE SPACES.
           05         FILLER        PIC X(10)     VALUE "ANB REPORT".

       01  HEADING-LINE-RECORD-REP.
           05         FILLER          PIC X(32)     VALUE SPACES.
           05         FILLER          PIC X(10)     VALUE ALL "-".

       01  FIELDS-RECORD-REP.
           05         FILLER         PIC X(05)     VALUE SPACES.
           05         FILLER         PIC X(07)     VALUE "CUST-ID".
           05         FILLER         PIC X(02)     VALUE SPACES.
           05         FILLER         PIC X(12)     VALUE "CUST-NAME".
           05         FILLER         PIC X(02)     VALUE SPACES.
           05         FILLER         PIC X(10)     VALUE "ACCOUNT-NO".
           05         FILLER         PIC X(02)     VALUE SPACES.
           05         FILLER         PIC X(12)     VALUE "LOAN-APPLIED".
           05         FILLER         PIC X(02)     VALUE SPACES.
           05         FILLER         PIC X(11)     VALUE "LOAN-STATUS".
           05         FILLER         PIC X(05)     VALUE SPACES.

       01  FIELDS-LINE-RECORD-REP.
           05         FILLER          PIC X(05)     VALUE SPACES.
           05         FILLER          PIC X(62)     VALUE ALL "-".

       01  BLANK-LINE-REP.
           05         FILLER          PIC X(80)     VALUE SPACES.

       01  DATA-RECORD-REP.
           05         FILLER           PIC X(05)     VALUE SPACES.
           05         CUST-ID-REP      PIC 9(04).
           05         FILLER           PIC X(05)     VALUE SPACES.
           05         CUST-NAME-REP    PIC A(12).
           05         FILLER           PIC X(02)     VALUE SPACES.
           05         ACC-NO-REP       PIC 9(06).
           05         FILLER           PIC X(06)     VALUE SPACES.
           05         LOAN-APPLIED-REP PIC 9(09).
           05         FILLER           PIC X(07)     VALUE SPACES.
           05         LOAN-STATUS-REP  PIC A(08).
           05         FILLER           PIC X(08)     VALUE SPACES.

       01  TOTAL-RECORD-REP.
           05         FILLER         PIC X(39)  VALUE SPACES.
           05         FILLER         PIC X(15)  VALUE "TOTAL RECORDS :".
           05         FILLER         PIC X(08)  VALUE SPACES.
           05         TOTAL-RECS-REP PIC 9(02).
           05         FILLER         PIC X(39)  VALUE SPACES.


       77             FS-OUT          PIC X(02)     VALUE SPACES.
       77             DATE-TIME-WS    PIC X(14)     VALUE SPACES.
       77             TOTAL-RECS      PIC 9(02)     VALUE 0.

           EXEC SQL
                INCLUDE BANKLOAN
           END-EXEC.

           EXEC SQL
                INCLUDE SQLCA
           END-EXEC.

           EXEC SQL
                DECLARE CUR-01 CURSOR FOR SELECT CUST_ID,
                                                 CUST_NAME,
                                                 ACC_NO,
                                                 LOAN_AMT_SAN,
                                                 LOAN_STATUS
                                            FROM CUST_TABLE
           END-EXEC.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO ANB BANKINGB REPORT"
           DISPLAY " ".

      *--- CAPTURE CURRENT DATE AND CURRENT TIME ----------------------
           MOVE FUNCTION CURRENT-DATE TO DATE-TIME-WS.

      *--- FORMAT  CURRENT DATE AND CURRENT TIME ----------------------
           STRING DATE-TIME-WS(7:2)   DELIMITED BY SIZE
                  "-"                 DELIMITED BY SIZE
                  DATE-TIME-WS(5:2)   DELIMITED BY SIZE
                  "-"                 DELIMITED BY SIZE
                  DATE-TIME-WS(1:4)   DELIMITED BY SIZE
             INTO DATE-REP.

           STRING DATE-TIME-WS(9:2)   DELIMITED BY SIZE
                  ":"                 DELIMITED BY SIZE
                  DATE-TIME-WS(11:2)  DELIMITED BY SIZE
                  ":"                 DELIMITED BY SIZE
                  DATE-TIME-WS(13:2)   DELIMITED BY SIZE
             INTO TIME-REP.
           PERFORM 1000-OPEN-PARA.

           PERFORM 2000-FETCH-PARA.
      *--- DISPLAY REPORT HEADING AND FIELD HEADING IN REPORT ---------
           WRITE OUT-FILE-RB FROM DATE-TIME-RECORD-REP.
           WRITE OUT-FILE-RB FROM BLANK-LINE-REP.
           WRITE OUT-FILE-RB FROM BLANK-LINE-REP.
           WRITE OUT-FILE-RB FROM HEADING-RECORD-REP.
           WRITE OUT-FILE-RB FROM HEADING-LINE-RECORD-REP.
           WRITE OUT-FILE-RB FROM BLANK-LINE-REP.
           WRITE OUT-FILE-RB FROM FIELDS-LINE-RECORD-REP.
           WRITE OUT-FILE-RB FROM FIELDS-RECORD-REP.
           WRITE OUT-FILE-RB FROM FIELDS-LINE-RECORD-REP.

           PERFORM 3000-EMPLOYEE-PARA UNTIL SQLCODE = 100.

           WRITE OUT-FILE-RB FROM FIELDS-LINE-RECORD-REP.
           MOVE  TOTAL-RECS  TO   TOTAL-RECS-REP.
           WRITE OUT-FILE-RB FROM TOTAL-RECORD-REP.
           WRITE OUT-FILE-RB FROM FIELDS-LINE-RECORD-REP.

           PERFORM 4000-CLOSE-PARA.

           DISPLAY " ".
           DISPLAY "THANK YOU FOR VISITING OUR REPORT".
           GOBACK.

      *----------------------------------------------------------------
      *--- OPEN THE CURSOR AND OUTPUT FILE-----------------------------
      *----------------------------------------------------------------
       1000-OPEN-PARA.
           EXEC SQL
                OPEN CUR-01
           END-EXEC.
           DISPLAY "CUR-01 OPEN STATUS  : ", SQLCODE

           OPEN OUTPUT OUT-FILE.
           DISPLAY "OUT-FILE OPEN STATUS : ", FS-OUT.
           DISPLAY " ".
           EXIT.

      *----------------------------------------------------------------
      *--- FETCH A ROW FROM CURSOR CONTROLLED TABLE -------------------
      *----------------------------------------------------------------
       2000-FETCH-PARA.
           EXEC SQL
                FETCH CUR-01 INTO :HV-CUST-ID,
                                  :HV-CUST-NAME,
                                  :HV-ACC-NO,
                                  :HV-LOAN-AMT-SAN,
                                  :HV-LOAN-STATUS
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS EMPLOYEE DETAILS -----------------------------------
      *----------------------------------------------------------------
       3000-EMPLOYEE-PARA.
           PERFORM 3100-WRITE-PARA.
           ADD 1 TO TOTAL-RECS.
      *----INITIALIZE HV-CUS-NAME.
           PERFORM 2000-FETCH-PARA.
           EXIT.
      *----------------------------------------------------------------
      *--- WRITE THE RECORD IN PS FILE --------------------------------
      *----------------------------------------------------------------
       3100-WRITE-PARA.
      *--- MOVE DATA FROM HOST VARIABLE TO WS-RECORD-VARIABLE ---------
           MOVE HV-CUST-ID         TO   CUST-ID-REP.
           MOVE HV-CUST-NAME       TO   CUST-NAME-REP.
           MOVE HV-ACC-NO           TO   ACC-NO-REP.
           MOVE HV-LOAN-AMT-SAN     TO   LOAN-APPLIED-REP.
           MOVE HV-LOAN-STATUS      TO   LOAN-STATUS-REP.

      *--- WRITE HV-RECORD-VARIABLE DATA TO PS FILE -------------------
           DISPLAY CUST-ID-REP, " WRITE STATUS : ", FS-OUT.
           INSPECT CUST-NAME-REP REPLACING ALL "-" BY " ".
           WRITE OUT-FILE-RB FROM DATA-RECORD-REP.
           EXIT.
      *----------------------------------------------------------------
      *--- CLOSE THE CURSOR -------------------------------------------
      *----------------------------------------------------------------
       4000-CLOSE-PARA.
           EXEC SQL
                CLOSE CUR-01
           END-EXEC.
           DISPLAY " ".
           DISPLAY "CUR-01 CLOSE STATUS  : ", SQLCODE.

           CLOSE OUT-FILE.
           DISPLAY "PS-FILE CLOSE STATUS : ", FS-OUT.
           DISPLAY " ".

           EXIT.
      *----------------------------------------------------------------

