      *----------------------------------------------------------------
      *--- COPY RECORDS FROM KSDS CLUSTER TO TABLE---------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOLDB3.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *--- KSDS INPUT FILE ENTRIES -----------------------------------
           SELECT KSDS-FILE ASSIGN TO DD01
           ORGANIZATION IS INDEXED
           ACCESS MODE IS SEQUENTIAL
           RECORD KEY IS CUST-ID-KSDS
           FILE STATUS IS FS-KSDS.
      *--- ERROR FILE ENTRIES -----------------------------------------
           SELECT ERR-FILE ASSIGN TO DD02
           ORGANIZATION IS SEQUENTIAL
           FILE STATUS IS FS-ERR.
      *----------------------------------------------------------------
       DATA DIVISION.

       FILE SECTION.
       FD  KSDS-FILE.
       01  KSDS-RB.
           05       CUST-ID-KSDS  PIC 9(04).
           05       FILLER        PIC X(146).

       FD  ERR-FILE
           LABEL RECORDS ARE STANDARD
           RECORDING MODE IS F.
       01  ERROR-RB.
           05    FILLER        PIC X(150).
       WORKING-STORAGE SECTION.

       01  CUSTOMER-WS.
           05       CUST-ID-WS      PIC 9(04).
           05       FILLER          PIC X(01).
           05       ACC-NO-WS       PIC 9(06).
           05       FILLER          PIC X(01).
           05       CUST-NAME-WS    PIC A(12).
           05       FILLER          PIC X(01).
           05       PAN-NO-WS       PIC X(10).
           05       FILLER          PIC X(01).
           05       AADHAR-NO-WS    PIC 9(12).
           05       FILLER          PIC X(01).
           05       MOBILE-NO-WS    PIC 9(10).
           05       FILLER          PIC X(01).
           05       INCOME-WS       PIC 9(06).
           05       FILLER          PIC X(01).
           05       CIBIL-SCORE-WS  PIC 9(03).
           05       FILLER          PIC X(01).
           05       CUST-AGE-WS     PIC 9(02).
           05       FILLER          PIC X(01).
           05       AMT-APP-WS      PIC 9(09).
           05       FILLER          PIC X(01).
           05       ADDRESS-WS      PIC X(25).
           05       FILLER          PIC X(01).
           05       LOAN-STATUS-WS  PIC A(08).

       77           FS-KSDS         PIC X(02)    VALUE SPACES.
       77           FS-ERR          PIC X(02)    VALUE SPACES.
       77           LOAN-AMT-PD-WS  PIC 9(07)    VALUE 0.
       77           TOTAL-RECS      PIC 9(02)    VALUE 0.
       77           VALID-RECS      PIC 9(02)    VALUE 0.
       77           INVALID-RECS    PIC 9(02)    VALUE 0.
       77           RECORD-STATUS   PIC X(10)    VALUE SPACES.
       77           LEN-1           PIC 9(02)    VALUE 0.
       77           LEN-2           PIC 9(02)    VALUE 0.

      *-- PLUG-IN DCLGEN MEMBER : TABLE STRUCTURE + HOST-VAR DECL. ----
           EXEC SQL
                INCLUDE BANKLOAN
           END-EXEC.

      *-- PLUG-IN SQLCA  MEMBER : SQLCODE VARIABLE DECLARATION --------
           EXEC SQL
                INCLUDE SQLCA
           END-EXEC.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO PROGRAM : COBOLDB3".
           DISPLAY " ".

      *----------------------------------------------------------------

           PERFORM 1000-OPEN-PARA.

           READ KSDS-FILE INTO CUSTOMER-WS.
           PERFORM 2000-CUSTOMER-PARA UNTIL FS-KSDS = "10".

           PERFORM 3000-CLOSE-PARA.

           PERFORM 4000-SHOW-STATS-PARA.

           DISPLAY "THANK YOU FOR USING PROGRAM COBOLDB3".
           STOP RUN.
      *----------------------------------------------------------------
      *--- OPEN THE INPUT FILE  ---------------------------------------
      *----------------------------------------------------------------
       1000-OPEN-PARA.
           OPEN INPUT KSDS-FILE.
           DISPLAY "PS FILE OPEN STATUS : ", FS-KSDS.
           OPEN OUTPUT ERR-FILE.
           DISPLAY "ERR-FILE OPEN STATUS : ", FS-ERR.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS CUSTOMER DETAILS -----------------------------------
      *----------------------------------------------------------------
       2000-CUSTOMER-PARA.
           PERFORM 2100-VALIDATE-PARA.
           PERFORM 2200-PROCESS-PARA.
           PERFORM 2300-INSERT-PARA.
           ADD 1 TO TOTAL-RECS.
           READ KSDS-FILE INTO CUSTOMER-WS.
           EXIT.
      *----------------------------------------------------------------
      *--- VALIDATE THE INPUT RECORD ----------------------------------
      *----------------------------------------------------------------
       2100-VALIDATE-PARA.
           EVALUATE TRUE
            WHEN CUST-ID-WS = 0 OR CUST-NAME-WS = SPACES OR
                CUST-AGE-WS = 0 OR MOBILE-NO-WS = 0 OR AADHAR-NO-WS = 0 0
                OR PAN-NO-WS = 0 OR INCOME-WS = 0 OR CIBIL-SCORE-WS = 0
                OR AMT-APP-WS = 0 OR ADDRESS-WS = SPACES
                           DISPLAY "V1 -> ", CUSTOMER-WS
                            MOVE "INVALID" TO RECORD-STATUS
                            MOVE "INVALID FIELDS" TO LOAN-STATUS-WS
                            ADD 1 TO INVALID-RECS
               WHEN CUST-ID-WS      IS NOT NUMERIC OR
                    CUST-AGE-WS     IS NOT NUMERIC OR
                    MOBILE-NO-WS    IS NOT NUMERIC OR
                    AADHAR-NO-WS    IS NOT NUMERIC OR
                    INCOME-WS       IS NOT NUMERIC OR
                    CIBIL-SCORE-WS  IS NOT NUMERIC OR
                    AMT-APP-WS      IS NOT NUMERIC
                            DISPLAY "V2 -> ", CUSTOMER-WS
                            MOVE "INVALID" TO RECORD-STATUS
                            MOVE "INVALID FIELDS" TO LOAN-STATUS-WS
                            ADD 1 TO INVALID-RECS
               WHEN CIBIL-SCORE-WS < 650
                            DISPLAY "V2 -> ", CUSTOMER-WS
                            MOVE "INVALID" TO RECORD-STATUS
                            MOVE "REJECTED" TO LOAN-STATUS-WS
                    WRITE ERROR-RB FROM CUSTOMER-WS
                            ADD 1 TO INVALID-RECS
               WHEN CIBIL-SCORE-WS < 750 AND AMT-APP-WS > 000500000
                            DISPLAY "V2 -> ", CUSTOMER-WS
                            MOVE "INVALID" TO RECORD-STATUS
                            MOVE "REJECTED" TO LOAN-STATUS-WS
                    WRITE ERROR-RB FROM CUSTOMER-WS
                            ADD 1 TO INVALID-RECS
               WHEN INCOME-WS < 15000
                            DISPLAY "V2 -> ", CUSTOMER-WS
                            MOVE "INVALID" TO RECORD-STATUS
                            MOVE "REJECTED" TO LOAN-STATUS-WS
                    WRITE ERROR-RB FROM CUSTOMER-WS
                            ADD 1 TO INVALID-RECS
               WHEN INCOME-WS < 30000 AND AMT-APP-WS > 000400000
                            DISPLAY "V2 -> ", CUSTOMER-WS
                            MOVE "INVALID" TO RECORD-STATUS
                            MOVE "REJECTED" TO LOAN-STATUS-WS
                    WRITE ERROR-RB FROM CUSTOMER-WS
                            ADD 1 TO INVALID-RECS
               WHEN AMT-APP-WS > 000800000
                            DISPLAY "V2 -> ", CUSTOMER-WS
                            MOVE "INVALID" TO RECORD-STATUS
                            MOVE "REJECTED" TO LOAN-STATUS-WS
                    WRITE ERROR-RB FROM CUSTOMER-WS
                            ADD 1 TO INVALID-RECS
               WHEN CUST-AGE-WS < 25
                            DISPLAY "V2 -> ", CUSTOMER-WS
                            MOVE "INVALID" TO RECORD-STATUS
                            MOVE "REJECTED" TO LOAN-STATUS-WS
                    WRITE ERROR-RB FROM CUSTOMER-WS
                            ADD 1 TO INVALID-RECS
               WHEN CUST-AGE-WS > 55
                            DISPLAY "V2 -> ", CUSTOMER-WS
                            MOVE "INVALID" TO RECORD-STATUS
                            MOVE "REJECTED" TO LOAN-STATUS-WS
                    WRITE ERROR-RB FROM CUSTOMER-WS
                            ADD 1 TO INVALID-RECS
               WHEN OTHER
                            MOVE "VALID" TO RECORD-STATUS
           END-EVALUATE.
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS THE CUSTOMER RECORD --------------------------------
      *----------------------------------------------------------------
       2200-PROCESS-PARA.
           IF RECORD-STATUS = "VALID"
              MOVE CUST-ID-WS     TO   HV-CUST-ID
              MOVE ACC-NO-WS      TO   HV-ACC-NO
              MOVE CUST-NAME-WS   TO   HV-CUST-NAME
              MOVE CUST-AGE-WS    TO   HV-CUST-AGE
              MOVE MOBILE-NO-WS   TO   HV-MOBILE-NO
              MOVE AADHAR-NO-WS   TO   HV-AADHAR-NO
              MOVE PAN-NO-WS      TO   HV-PAN-NO
              MOVE INCOME-WS      TO   HV-INCOME
              MOVE CIBIL-SCORE-WS TO   HV-CIBIL-SCORE
              MOVE AMT-APP-WS     TO   HV-AMT-APP
              MOVE ADDRESS-WS     TO   HV-ADDRESS
      *--- CODE TO HANDLE A VARCHAR COLUMN : ADDRESS ------------------
              MOVE ADDRESS-WS     TO   HV-ADDRESS-TEXT

              MOVE 0 TO LEN-1
              MOVE 0 TO LEN-2
              MOVE LENGTH OF ADDRESS-WS TO LEN-1
              INSPECT FUNCTION REVERSE(ADDRESS-WS)  TALLYING LEN-2
                                   FOR LEADING "-"
              COMPUTE HV-ADDRESS-LEN  = LEN-1 - LEN-2
              MOVE AMT-APP-WS     TO   HV-LOAN-AMT-SAN
              MOVE "APPROVED"     TO   HV-LOAN-STATUS
           END-IF.
           EXIT.
      *----------------------------------------------------------------
      *--- INSERT THE ROW IN THE TABLE --------------------------------
      *----------------------------------------------------------------
       2300-INSERT-PARA.
           IF RECORD-STATUS = "VALID"
              EXEC SQL
                   INSERT INTO CUST_TABLE VALUES(:HV-CUST-ID,
                                                 :HV-ACC-NO,
                                                 :HV-CUST-NAME,
                                                 :HV-PAN-NO,
                                                 :HV-AADHAR-NO,
                                                 :HV-MOBILE-NO,
                                                 :HV-INCOME,
                                                 :HV-CIBIL-SCORE,
                                                 :HV-CUST-AGE,
                                                 :HV-AMT-APP,
                                                 :HV-ADDRESS,
                                                 :HV-LOAN-STATUS,
                                                 :HV-LOAN-AMT-SAN)

              END-EXEC
              EVALUATE TRUE
                   WHEN SQLCODE = 0
                        DISPLAY HV-CUST-ID, " HAS BEEN INSERTED"
                        ADD 1 TO VALID-RECS
                   WHEN SQLCODE = -803
                        DISPLAY CUSTOMER-WS
                        DISPLAY HV-CUST-ID, " ALREADY EXISTS IN TABLE"
                        ADD 1 TO INVALID-RECS
                   WHEN OTHER
                        DISPLAY CUSTOMER-WS
                        DISPLAY HV-CUST-ID, " INSERT ERROR : ", SQLCODE
                        ADD 1 TO INVALID-RECS
              END-EVALUATE
           END-IF.
           EXIT.
      *----------------------------------------------------------------
      *--- CLOSE THE INPUT FILE ---------------------------------------
      *----------------------------------------------------------------
       3000-CLOSE-PARA.
           DISPLAY " ".
           CLOSE KSDS-FILE.
           DISPLAY "PS FILE CLOSE STATUS : ", FS-KSDS.

           CLOSE ERR-FILE.
           DISPLAY "ERR-FILE CLOSE STATUS    : ", FS-ERR.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- DISPLAY THE STATISTICS -------------------------------------
      *----------------------------------------------------------------
       4000-SHOW-STATS-PARA.
           DISPLAY "TOTAL RECORDS PROCESSED : ", TOTAL-RECS.
           DISPLAY "TOTAL VALID RECORDS     : ", VALID-RECS.
           DISPLAY "TOTAL INVALID RECORDS   : ", INVALID-RECS.
           EXIT.
      *----------------------------------------------------------------
