      *----------------------------------------------------------------
      *--- CURSOR PROGRAM : COPY SPECIFIC ROWS FROM TABLE TO ESDS -----
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASGN03.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ESDS-FILE ASSIGN TO AS-DD01
           ORGANIZATION IS SEQUENTIAL
           FILE STATUS IS FS-ESDS.
      *----------------------------------------------------------------
       DATA DIVISION.

       FILE SECTION.
       FD  ESDS-FILE
           LABEL RECORDS ARE STANDARD.
       01  ESDS-FILE-RB.
           05     FILLER      PIC X(80).

       WORKING-STORAGE SECTION.
       01  COLLEGE-WS.
           05   ROLL-NO-WS           PIC 9(04).
           05   FILLER               PIC X(01).
           05   STUD-NAME-WS         PIC X(15).
           05   FILLER               PIC X(01).
           05   RESULT-WS            PIC A(04).

       77       FS-ESDS              PIC X(02)     VALUE SPACES.
       77       TOTAL-RECS           PIC 9(02)     VALUE 0.

           EXEC SQL
                INCLUDE CLG194
           END-EXEC.

           EXEC SQL
                INCLUDE SQLCA
           END-EXEC.

           EXEC SQL
                DECLARE CUR-01 CURSOR FOR SELECT ROLL_NO,
                                                 STUD_NAME,
                                                 RESULT
                                            FROM CLG194
           END-EXEC.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO PROGRAM : ASGN03".
           DISPLAY " ".

           PERFORM 1000-OPEN-PARA.

           PERFORM 2000-FETCH-PARA.
           PERFORM 3000-COLLEGE-PARA UNTIL SQLCODE = 100.

           PERFORM 4000-CLOSE-PARA.

           PERFORM 5000-SHOW-STATS-PARA.

           DISPLAY " ".
           DISPLAY "THANK YOU FOR USING PROGRAM ASGN03".
           GOBACK.
      *----------------------------------------------------------------
      *--- OPEN THE CURSOR --------------------------------------------
      *----------------------------------------------------------------
       1000-OPEN-PARA.
           EXEC SQL
                OPEN CUR-01
           END-EXEC.
           DISPLAY "CUR-01 OPEN STATUS  : ", SQLCODE

           OPEN OUTPUT ESDS-FILE.
           DISPLAY "ESDS-FILE OPEN STATUS : ", FS-ESDS.

           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- FETCH A ROW FROM CURSOR CONTROLLED TABLE -------------------
      *----------------------------------------------------------------
       2000-FETCH-PARA.
           EXEC SQL
                FETCH CUR-01 INTO :HV-ROLL-NO,
                                  :HV-STUD-NAME,
                                  :HV-RESULT
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS COLLEGE DETAILS -----------------------------------
      *----------------------------------------------------------------
       3000-COLLEGE-PARA.
           PERFORM 3100-WRITE-PARA.
           INITIALIZE HV-STUD-NAME, HV-RESULT.
           PERFORM 2000-FETCH-PARA.
           EXIT.
      *----------------------------------------------------------------
      *--- WRITE THE RECORD IN PS FILE --------------------------------
      *----------------------------------------------------------------
       3100-WRITE-PARA.
      *--- MOVE DATA FROM HOST VARIABLE TO WS-RECORD-VARIABLE ---------
           MOVE HV-ROLL-NO          TO   ROLL-NO-WS.
           MOVE HV-STUD-NAME-TEXT   TO   STUD-NAME-WS.
           MOVE HV-RESULT           TO   RESULT-WS.

      *--- WRITE WS-RECORD-VARIABLE DATA TO ESDS FILE ---------------
           WRITE ESDS-FILE-RB FROM COLLEGE-WS.
           DISPLAY ROLL-NO-WS, " WRITE STATUS : ", FS-ESDS.
           ADD 1 TO TOTAL-RECS.
           EXIT.
      *----------------------------------------------------------------
      *--- CLOSE THE CURSOR -------------------------------------------
      *----------------------------------------------------------------
       4000-CLOSE-PARA.
           EXEC SQL
                CLOSE CUR-01
           END-EXEC.
           DISPLAY " ".
           DISPLAY "CUR-01 CLOSE STATUS  : ", SQLCODE.

           CLOSE ESDS-FILE.
           DISPLAY "ESDS FILE CLOSE STATUS : ", FS-ESDS.
           DISPLAY " ".

           EXIT.
      *----------------------------------------------------------------
      *--- DISPLAY THE STATISTICS -------------------------------------
      *----------------------------------------------------------------
       5000-SHOW-STATS-PARA.
           DISPLAY " ".
           DISPLAY "TOTAL ROWS PROCESSED : ", TOTAL-RECS.
           EXIT.
      *----------------------------------------------------------------
