      *----------------------------------------------------------------
      *--- CURSOR PROGRAM : DISPLAY ALL ROWS OF A TABLE IN SPOOL ------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2PGM04.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77       TOTAL-RECS           PIC 9(02)     VALUE 0.
       77       SALARY-EDIT          PIC Z,ZZ,ZZ9.99.

           EXEC SQL
                INCLUDE EMP194
           END-EXEC.

           EXEC SQL
                INCLUDE SQLCA
           END-EXEC.

           EXEC SQL
                DECLARE CUR-01 CURSOR FOR SELECT EMP_NO,
                                                 EMP_NAME,
                                                 PROJECT,
                                                 JOIN_DATE,
                                                 SALARY
                                            FROM EMP194
                                          WHERE YEAR(JOIN_DATE) >= 2018
           END-EXEC.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO PROGRAM : DB2PGM04".
           DISPLAY " ".

           PERFORM 1000-OPEN-PARA.

           PERFORM 2000-FETCH-PARA.
           PERFORM 3000-EMPLOYEE-PARA UNTIL SQLCODE = 100.

           PERFORM 4000-CLOSE-PARA.

           PERFORM 5000-SHOW-STATS-PARA.

           DISPLAY " ".
           DISPLAY "THANK YOU FOR USING PROGRAM DB2PGM04".
           GOBACK.
      *----------------------------------------------------------------
      *--- OPEN THE CURSOR --------------------------------------------
      *----------------------------------------------------------------
       1000-OPEN-PARA.
           EXEC SQL
                OPEN CUR-01
           END-EXEC.
           DISPLAY "CUR-01 OPEN STATUS : ", SQLCODE
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- FETCH A ROW FROM CURSOR CONTROLLED TABLE -------------------
      *----------------------------------------------------------------
       2000-FETCH-PARA.
           EXEC SQL
                FETCH CUR-01 INTO :HV-EMP-NO,
                                  :HV-EMP-NAME,
                                  :HV-PROJECT,
                                  :HV-JOIN-DATE,
                                  :HV-SALARY
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS EMPLOYEE DETAILS -----------------------------------
      *----------------------------------------------------------------
       3000-EMPLOYEE-PARA.
           PERFORM 3100-DISPLAY-PARA.
           INITIALIZE HV-EMP-NAME, HV-PROJECT.
           PERFORM 2000-FETCH-PARA.
           EXIT.
      *----------------------------------------------------------------
      *--- DISPLAY EMPLOYEE DETAILS -----------------------------------
      *----------------------------------------------------------------
       3100-DISPLAY-PARA.
           MOVE HV-SALARY TO SALARY-EDIT.
           DISPLAY HV-EMP-NO, " ",
                   HV-EMP-NAME-LEN, ":",
                   HV-EMP-NAME-TEXT, " ",
                   HV-PROJECT-LEN, ":",
                   HV-PROJECT-TEXT, " ",
                   HV-JOIN-DATE, " ",
                   SALARY-EDIT.
           ADD 1 TO TOTAL-RECS.
           EXIT.
      *----------------------------------------------------------------
      *--- CLOSE THE CURSOR -------------------------------------------
      *----------------------------------------------------------------
       4000-CLOSE-PARA.
           EXEC SQL
                CLOSE CUR-01
           END-EXEC.
           DISPLAY " ".
           DISPLAY "CUR-01 CLOSE STATUS : ", SQLCODE.
           EXIT.
      *----------------------------------------------------------------
      *--- DISPLAY THE STATISTICS -------------------------------------
      *----------------------------------------------------------------
       5000-SHOW-STATS-PARA.
           DISPLAY " ".
           DISPLAY "TOTAL ROWS PROCESSED : ", TOTAL-RECS.
           EXIT.
      *----------------------------------------------------------------
