      *----------------------------------------------------------------
      *--- COPY ROWS FROM TABLE TO TABLE ------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2PGM08.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       77  DATE-TODAY           PIC 9(08)     VALUE 0.
       77  QTY-WS               PIC 9(04)     VALUE 0.

           EXEC SQL
                INCLUDE PRODMAST
           END-EXEC.

           EXEC SQL
                INCLUDE PRODTRAN
           END-EXEC.

           EXEC SQL
                INCLUDE SQLCA
           END-EXEC.

           EXEC SQL
                DECLARE CUR01 CURSOR FOR SELECT PROD_NO,
                                                PROD_NAME,
                                                RATE,
                                                QTY
                                           FROM PROD_MASTER
                                          WHERE PROD_NAME IS NOT NULL
           END-EXEC.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : DB2PGM08".
           DISPLAY " ".

           EXEC SQL
                DELETE FROM PROD_TRANS
           END-EXEC.
           EXEC SQL
                COMMIT
           END-EXEC.

           PERFORM 1000-OPEN-PARA.

           PERFORM 2000-FETCH-PARA.
           PERFORM 3000-PRODUCT-PARA UNTIL SQLCODE = 100.

           PERFORM 4000-CLOSE-PARA.

           DISPLAY "THANK YOU FOR USING PROGRAM DB2PGM08".
           GOBACK.
      *----------------------------------------------------------------
      *--- OPEN THE CURSOR --------------------------------------------
      *----------------------------------------------------------------
       1000-OPEN-PARA.
           EXEC SQL
                OPEN CUR01
           END-EXEC.
           DISPLAY " ".
           DISPLAY "CUR01 CURSOR OPEN STATUS : ", SQLCODE.
           EXIT.
      *----------------------------------------------------------------
      *--- FETCH THE ROW ----------------------------------------------
      *----------------------------------------------------------------
       2000-FETCH-PARA.
           EXEC SQL
                FETCH CUR01 INTO :HV-1-PROD-NO,
                                 :HV-1-PROD-NAME,
                                 :HV-1-RATE,
                                 :HV-1-QTY
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS PRODUCT ROW ----------------------------------------
      *----------------------------------------------------------------
       3000-PRODUCT-PARA.
           PERFORM 3100-PROCESS-PARA.
           PERFORM 2000-FETCH-PARA.
           EXIT.
      *----------------------------------------------------------------
      *--- PERFORM CALCULATIONS AND INSERT ROW IN TRANSACTION TABLE ---
      *----------------------------------------------------------------
       3100-PROCESS-PARA.
           MOVE HV-1-PROD-NO TO HV-2-PROD-NO.
           MOVE HV-1-RATE    TO HV-2-RATE.
           MOVE HV-1-QTY     TO HV-2-QTY.
           MULTIPLY HV-2-RATE BY HV-2-QTY GIVING HV-2-AMOUNT.
           IF HV-2-QTY < 10
              MOVE HV-2-QTY TO QTY-WS
              STRING "BELOW MIN. STOCK : " DELIMITED BY SIZE
                     QTY-WS                DELIMITED BY SIZE
                     "  "                  DELIMITED BY SIZE
                INTO HV-2-REMARKS
           ELSE
              MOVE "ENOUGH STOCK" TO HV-2-REMARKS
           END-IF.
           ACCEPT DATE-TODAY FROM DATE YYYYMMDD.
           STRING DATE-TODAY(1:4) DELIMITED BY SIZE
                  "-"             DELIMITED BY SIZE
                  DATE-TODAY(5:2) DELIMITED BY SIZE
                  "-"             DELIMITED BY SIZE
                  DATE-TODAY(7:2) DELIMITED BY SIZE
             INTO HV-2-ENTRY-DATE.

           EXEC SQL
                INSERT INTO PROD_TRANS VALUES(:HV-2-PROD-NO,
                                              :HV-2-RATE,
                                              :HV-2-QTY,
                                              :HV-2-AMOUNT,
                                              :HV-2-REMARKS,
                                              :HV-2-ENTRY-DATE)
           END-EXEC.
           EVALUATE TRUE
               WHEN SQLCODE = 0
                    DISPLAY HV-2-PROD-NO, " INSERTED IN PROD_TRANS"
               WHEN SQLCODE = -803
                    DISPLAY HV-2-PROD-NO, " ALREADY EXISTS"
               WHEN OTHER
                    DISPLAY HV-2-PROD-NO, " INSERT ERROR : ", SQLCODE
           END-EVALUATE.
           EXIT.
      *----------------------------------------------------------------
      *--- CLOSE THE CURSOR -------------------------------------------
      *----------------------------------------------------------------
       4000-CLOSE-PARA.
           EXEC SQL
                CLOSE CUR01
           END-EXEC.
           DISPLAY " ".
           DISPLAY "CUR01 CURSOR CLOSE STATUS : ", SQLCODE.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
