      *----------------------------------------------------------------
      *--- COPY ROWS FROM TABLE TO TABLE ------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2PGM07.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.

      *--- PLUG-IN DCLGEN MEMBER OF MASTER TABLE ----------------------
           EXEC SQL
                INCLUDE EMPMAST
           END-EXEC.

      *--- PLUG-IN DCLGEN MEMBER OF TRANSACTION TABLE -----------------
           EXEC SQL
                INCLUDE EMPTRAN
           END-EXEC.

      *--- PLUG-IN SQLCA MEMBER ---------------------------------------
           EXEC SQL
                INCLUDE SQLCA
           END-EXEC.

      *--- DECLARE THE CURSOR -----------------------------------------
           EXEC SQL
                DECLARE CUR01 CURSOR FOR SELECT EMP_NO,
                                                EMP_NAME,
                                                BASIC_SAL
                                           FROM EMP_MASTER
                                          WHERE EMP_NAME IS NOT NULL
           END-EXEC.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : DB2PGM07".
           DISPLAY " ".

           EXEC SQL
                DELETE FROM EMP_TRANS
           END-EXEC.
           EXEC SQL
                COMMIT
           END-EXEC.

           PERFORM 1000-OPEN-PARA.

           PERFORM 2000-FETCH-PARA.
           PERFORM 3000-EMPLOYEE-PARA UNTIL SQLCODE = 100.

           PERFORM 4000-CLOSE-PARA.

           DISPLAY "THANK YOU FOR USING PROGRAM DB2PGM07".
           GOBACK.
      *----------------------------------------------------------------
      *--- OPEN THE CURSOR --------------------------------------------
      *----------------------------------------------------------------
       1000-OPEN-PARA.
           EXEC SQL
                OPEN CUR01
           END-EXEC.
           DISPLAY "CUR01 CURSOR OPEN STATUS : ", SQLCODE.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- FETCH THE ROW FROM MASTER TABLE ----------------------------
      *----------------------------------------------------------------
       2000-FETCH-PARA.
           EXEC SQL
                FETCH CUR01 INTO :HV-M-EMP-NO,
                                 :HV-M-EMP-NAME,
                                 :HV-M-BASIC-SAL
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS THE EMPLOYEE DETAILS -------------------------------
      *----------------------------------------------------------------
       3000-EMPLOYEE-PARA.
           PERFORM 3100-PROCESS-PARA.
           PERFORM 2000-FETCH-PARA.
           EXIT.
      *----------------------------------------------------------------
      *--- PERFORM CALCULATIONS AND OTHER OPERATIONS ------------------
      *----------------------------------------------------------------
       3100-PROCESS-PARA.
           MOVE    HV-M-EMP-NO       TO   HV-T-EMP-NO.
           MOVE    HV-M-BASIC-SAL    TO   HV-T-BASIC-SAL.
           COMPUTE HV-T-D-A          =    0.4 * HV-T-BASIC-SAL.
           COMPUTE HV-T-H-R-A        =    0.15 * HV-T-BASIC-SAL.
           COMPUTE HV-T-GROSS-SAL    =    HV-T-BASIC-SAL + HV-T-D-A
                                                         + HV-T-H-R-A.

           EXEC SQL
                INSERT INTO EMP_TRANS VALUES(:HV-T-EMP-NO,
                                             :HV-T-BASIC-SAL,
                                             :HV-T-D-A,
                                             :HV-T-H-R-A,
                                             :HV-T-GROSS-SAL,
                                             CURRENT TIMESTAMP)
           END-EXEC.
           EVALUATE TRUE
               WHEN SQLCODE = 0
                    DISPLAY HV-T-EMP-NO, " INSERTED IN EMP_TRANS TABLE"
               WHEN SQLCODE = -803
                    DISPLAY HV-T-EMP-NO, " ALREADY EXISTS"
               WHEN OTHER
                    DISPLAY HV-T-EMP-NO, " INSERT ERROR : ", SQLCODE
           END-EVALUATE.
           EXIT.
      *----------------------------------------------------------------
      *--- CLOSE THE CURSOR -------------------------------------------
      *----------------------------------------------------------------
       4000-CLOSE-PARA.
           EXEC SQL
                CLOSE CUR01
           END-EXEC.
           DISPLAY " ".
           DISPLAY "CUR01 CURSOR CLOSE STATUS : ", SQLCODE.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
