      *----------------------------------------------------------------
      *---  DISPLAY ALL RECORDS FROM PS FILE TO SPOOL -----------------
      *---  VALIDATE THE INPUT RECORDS --------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASSIGN01.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *--- PS-FILE ENTRIES --------------------------------------------
           SELECT PS-FILE ASSIGN TO DD01
           ORGANIZATION IS SEQUENTIAL
           FILE STATUS IS FS-PS.
      *----------------------------------------------------------------
       DATA DIVISION.

       FILE SECTION.
       FD  PS-FILE
           LABEL RECORDS ARE STANDARD
           RECORDING MODE IS F.
       01  EMPLOYEE-RB.
           05    EMP-NAME-RB   PIC A(25).
           05    FILLER        PIC X(01).
           05    D-OF-B-RB     PIC X(10).
           05    FILLER        PIC X(01).
           05    MOBILE-RB     PIC X(12).
           05    FILLER        PIC X(31).

       WORKING-STORAGE SECTION.
       01  EMPLOYEE-WS.
           05    EMP-NAME-WS   PIC A(25).
           05    FILLER        PIC X(01).
           05    D-OF-B-WS     PIC X(10).
           05    FILLER        PIC X(01).
           05    MOBILE-WS     PIC X(12).

       77        FS-PS         PIC X(02)         VALUE SPACES.
       77        F-NAME        PIC X(10)         VALUE SPACES.
       77        M-NAME        PIC X(10)         VALUE SPACES.
       77        S-NAME        PIC X(10)         VALUE SPACES.
       77        DOB-WS        PIC X(10)         VALUE SPACES.
       77        MOBILE-NUM-WS PIC X(12)         VALUE SPACES.
       77        VALID-RECS    PIC 9(02)         VALUE ZERO.
       77        INVALID-RECS  PIC 9(02)         VALUE ZERO.
       77        TOTAL-RECS    PIC 9(02)         VALUE ZERO.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : ASSIGN09".
           DISPLAY " ".

           PERFORM 1000-OPEN-PARA.

      *--- READ THE FIRST RECORD FROM THE FILE ------------------------
           READ PS-FILE INTO EMPLOYEE-WS.
           PERFORM 2000-EMPLOYEE-PARA UNTIL FS-PS = "10".

           PERFORM 3000-CLOSE-PARA.

           PERFORM 4000-SHOW-STATS-PARA.

           DISPLAY "THANK YOU FOR USING PROGRAM ASSIGN09".
           STOP RUN.
      *----------------------------------------------------------------
      *--- OPEN THE FILE ----------------------------------------------
      *----------------------------------------------------------------
       1000-OPEN-PARA.
           OPEN INPUT PS-FILE.
           DISPLAY "PS-FILE OPEN STATUS : ", FS-PS.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS EMPLOYEE RECORD ------------------------------------
      *----------------------------------------------------------------
       2000-EMPLOYEE-PARA.

           INSPECT EMP-NAME-WS REPLACING ALL "-" BY " ".
           INSPECT DOB-WS REPLACING ALL "-" BY " ".
           INSPECT MOBILE-NUM-WS REPLACING ALL "-" BY " ".
      *----DATE OF BIRTH -----------------------------------------------
           MOVE D-OF-B-WS(5:4) TO DOB-WS(1:4).
           MOVE "-"            TO DOB-WS(5:1).
           MOVE D-OF-B-WS(3:2) TO DOB-WS(6:2).
           MOVE "-"            TO DOB-WS(8:1).
           MOVE D-OF-B-WS(1:2) TO DOB-WS(9:2).
           MOVE DOB-WS         TO D-OF-B-WS.
      *-----------------------------------------------------------------
           MOVE MOBILE-WS(1:3) TO MOBILE-NUM-WS(1:3).
           MOVE "-"            TO MOBILE-NUM-WS(4:1).
           MOVE MOBILE-WS(4:3) TO MOBILE-NUM-WS(5:3).
           MOVE "-"            TO MOBILE-NUM-WS(8:1).
           MOVE MOBILE-WS(8:3) TO MOBILE-NUM-WS(9:4).
           MOVE MOBILE-NUM-WS  TO MOBILE-WS.
           IF EMP-NAME-WS = SPACES OR D-OF-B-WS = 0 OR MOBILE-WS = 0
              DISPLAY "INVALID -> ", EMPLOYEE-WS
              COMPUTE INVALID-RECS = INVALID-RECS + 1
           ELSE
              IF EMP-NAME-WS IS NOT ALPHABETIC
                      DISPLAY "INVALID -> ", EMPLOYEE-WS
                      COMPUTE INVALID-RECS = INVALID-RECS + 1
              ELSE
                 PERFORM 2100-FORMAT-PARA
                 DISPLAY "VALID.. -> ", EMPLOYEE-WS
                 COMPUTE VALID-RECS = VALID-RECS + 1
              END-IF
           END-IF.
           COMPUTE TOTAL-RECS = TOTAL-RECS + 1.

      *--- READ NEXT RECORD FROM THE FILE -----------------------------
           READ PS-FILE INTO EMPLOYEE-WS.

           EXIT.
      *----------------------------------------------------------------
      *--- FORMAT THE NAME --------------------------------------------
      *----------------------------------------------------------------
       2100-FORMAT-PARA.
           UNSTRING EMP-NAME-WS DELIMITED BY " "
               INTO F-NAME, M-NAME, S-NAME.
           INITIALIZE EMP-NAME-WS.
           STRING S-NAME      DELIMITED BY SPACE
                  " "         DELIMITED BY SIZE
                  M-NAME(1:1) DELIMITED BY SPACE
                  ". "        DELIMITED BY SIZE
                  F-NAME      DELIMITED BY SPACE
             INTO EMP-NAME-WS.
           EXIT.
      *----------------------------------------------------------------
      *--- CLOSE THE FILE ---------------------------------------------
      *----------------------------------------------------------------
       3000-CLOSE-PARA.
           CLOSE PS-FILE.
           DISPLAY " ".
           DISPLAY "PS-FILE CLOSE STATUS    : ", FS-PS.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- DISPLAY THE STATISTICS -------------------------------------
      *----------------------------------------------------------------
       4000-SHOW-STATS-PARA.
           DISPLAY " ".
           DISPLAY "TOTAL RECORDS PROCESSED : ", TOTAL-RECS.
           DISPLAY "TOTAL RECORDS VALID     : ", VALID-RECS.
           DISPLAY "TOTAL RECORDS INVALID   : ", INVALID-RECS.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
