      *----------------------------------------------------------------
      *---  DISPLAY ALL RECORDS FROM PS FILE TO SPOOL -----------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASSIGN08.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *--- PS-FILE ENTRIES --------------------------------------------
           SELECT PS-FILE ASSIGN TO DD01
           ORGANIZATION IS SEQUENTIAL
           FILE STATUS IS FS-PS.
      *----------------------------------------------------------------
       DATA DIVISION.

       FILE SECTION.
       FD  PS-FILE
           LABEL RECORDS ARE STANDARD
           RECORDING MODE IS F.
       01  EMPLOYEE-RB.
           05    EMP-NAME-RB   PIC A(25).
           05    FILLER        PIC X(01).
           05    D-O-B-RB      PIC X(10).
           05    FILLER        PIC X(02).
           05    MOBILE-RB     PIC X(12).
           05    FILLER        PIC X(30).

       WORKING-STORAGE SECTION.
       01  EMPLOYEE-WS.
           05    EMP-NAME-WS   PIC A(25).
           05    FILLER        PIC X(01).
           05    BASIC-SAL-WS  PIC X(10).
           05    FILLER        PIC X(01).
           05    MOBILE-RB     PIC X(12).

       77        FS-PS         PIC X(02)         VALUE SPACES.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : ASSIGN08".
           DISPLAY " ".

           PERFORM 1000-OPEN-PARA.

      *--- READ THE FIRST RECORD FROM THE FILE ------------------------
           READ PS-FILE INTO EMPLOYEE-WS.
           PERFORM 2000-EMPLOYEE-PARA UNTIL FS-PS = "10".

           PERFORM 3000-CLOSE-PARA.

           DISPLAY "THANK YOU FOR USING PROGRAM ASSIGN08".
           STOP RUN.
      *----------------------------------------------------------------
      *--- OPEN THE FILE ----------------------------------------------
      *----------------------------------------------------------------
       1000-OPEN-PARA.
           OPEN INPUT PS-FILE.
           DISPLAY "PS-FILE OPEN STATUS : ", FS-PS.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS EMPLOYEE RECORD ------------------------------------
      *----------------------------------------------------------------
       2000-EMPLOYEE-PARA.
           DISPLAY EMPLOYEE-WS.

      *--- READ NEXT RECORD FROM THE FILE -----------------------------
           READ PS-FILE INTO EMPLOYEE-WS.

           EXIT.
      *----------------------------------------------------------------
      *--- CLOSE THE FILE ---------------------------------------------
      *----------------------------------------------------------------
       3000-CLOSE-PARA.
           CLOSE PS-FILE.
           DISPLAY " ".
           DISPLAY "PS-FILE CLOSE STATUS : ", FS-PS.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
