      *---------------------------------------------------------------- 00010001
      *--- CUSTOMER-RECORD--------------------------------------------- 00020001
      *---------------------------------------------------------------- 00030001
       IDENTIFICATION DIVISION.                                         00040001
       PROGRAM-ID. COBPGM01.                                            00050001
       AUTHOR. MADHAV.                                                  00060001
       DATE-WRITTEN. 24-07-2024.                                        00070001
       DATE-COMPILED. 24-07-2024.                                       00080001
      *---------------------------------------------------------------- 00090001
       ENVIRONMENT DIVISION.                                            00100001
      *---------------------------------------------------------------- 00110001
       DATA DIVISION.                                                   00120001
       WORKING-STORAGE SECTION.                                         00130001
       01  NUMBER-RECORD.                                               00140001
           05     NUM-1      PIC 9(03).                                 00150001
           05     FILLER     PIC X(01).                                 00160001
           05     NUM-2      PIC 9(03).                                 00170001
           05     FILLER     PIC X(01).                                 00180001
           05     NUM-3      PIC 9(03).                                 00190001
           05     FILLER     PIC X(01).                                 00200001
           05     MAX-NUM    PIC 9(03).                                 00210001
      *---------------------------------------------------------------- 00220001
       PROCEDURE DIVISION.                                              00230001
      *---------------------------------------------------------------- 00240001
      *--- PROGRAM LOGIC STARTS HERE ---------------------------------- 00250001
      *---------------------------------------------------------------- 00260001
       MAIN-PARA.                                                       00270001
           DISPLAY "WELCOME TO MY PROGRAM : COBPGM03".                  00280001
           DISPLAY " ".                                                 00290001
                                                                        00300001
           ACCEPT NUMBER-RECORD.                                        00310001
                                                                        00320001
           IF NUM-1 > NUM-2 AND NUM-1 > NUM-3                           00330001
              MOVE NUM-1 TO MAX-NUM                                     00340001
           ELSE                                                         00350001
              IF NUM-2 > NUM-3                                          00360001
                 MOVE NUM-2 TO MAX-NUM                                  00370001
              ELSE                                                      00380001
                 MOVE NUM-3 TO MAX-NUM                                  00390001
              END-IF                                                    00400001
           END-IF.                                                      00410001
                                                                        00420001
           DISPLAY "MAXIMUM OF ", NUM-1, " ", NUM-2, " ", NUM-3, " = ", 00430001
                   MAX-NUM.                                             00440001
           DISPLAY " ".                                                 00450001
                                                                        00460001
           DISPLAY "THANK YOU FOR USING PROGRAM COBPGM03".              00470001
           STOP RUN.                                                    00480001
      *---------------------------------------------------------------- 00490001
