      *----------------------------------------------------------------
      *--- WRITE VALID RECORDS IN A KSDS FILE -------------------------
      *--- WRITE INVALID RECORDS IN A PS FILE -------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASSIGN04.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

      *--- PS INPUT FILE ENTRIES --------------------------------------
           SELECT PS-IN-FILE ASSIGN TO DD01
           ORGANIZATION IS SEQUENTIAL
           FILE STATUS IS FS-PS-IN.

      *--- KSDS OUTPUT FILE ENTRIES -----------------------------------
           SELECT KSDS-OUT-FILE ASSIGN TO DD02
           ORGANIZATION IS INDEXED
           ACCESS MODE IS RANDOM
           RECORD KEY IS ROLL-NO-RB
           FILE STATUS IS FS-KSDS-OUT.

      *--- PS ERROR FILE ENTRIES --------------------------------------
           SELECT PS-ERR-FILE ASSIGN TO DD03
           ORGANIZATION IS SEQUENTIAL
           FILE STATUS IS FS-PS-ERR.
      *----------------------------------------------------------------
       DATA DIVISION.

       FILE SECTION.
       FD  PS-IN-FILE
           LABEL RECORDS ARE STANDARD
           RECORDING MODE IS F.
       01  INPUT-FILE-RB.
           05        FILLER        PIC X(80).

       FD  KSDS-OUT-FILE
           LABEL RECORDS ARE STANDARD.
       01  OUTPUT-FILE-RB.
           05        ROLL-NO-RB    PIC 9(03).
           05        FILLER        PIC X(77).

       FD  PS-ERR-FILE
           LABEL RECORDS ARE STANDARD
           RECORDING MODE IS F.
       01  ERROR-FILE-RB.
           05        FILLER        PIC X(80).

       WORKING-STORAGE SECTION.
       01   PRODUCT-WS.
            05     ROLL-NO-WS      PIC 9(03).
            05     FILLER          PIC X(01).
            05     PROD-NAME-WS    PIC X(10).
            05     FILLER          PIC X(01).
            05     BILL-WS         PIC 9(05).

       01   OUTPUT-WS.
            05     R-NO-WS         PIC 9(03).
            05     FILLER          PIC X(01).
            05     P-NAME-WS       PIC X(10).
            05     FILLER          PIC X(01).
            05     PRICE-AMT-WS    PIC 9(05).
            05     FILLER          PIC X(01).
            05     DISCOUNT-WS     PIC 9(05).
            05     FILLER          PIC X(01).
            05     NET-AMT-WS      PIC 9(05).
            05     FILLER          PIC X(01).
            05     REMARKS-WS      PIC X(15).

       77           FS-PS-IN       PIC X(02)      VALUE SPACES.
       77           FS-KSDS-OUT    PIC X(02)      VALUE SPACES.
       77           FS-PS-ERR      PIC X(02)      VALUE SPACES.
       77           TOTAL-RECS     PIC 9(02)      VALUE 0.
       77           VALID-RECS     PIC 9(02)      VALUE 0.
       77           INVALID-RECS   PIC 9(02)      VALUE 0.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : ASSIGN04".
           DISPLAY " ".

           PERFORM 1000-OPEN-PARA.

           READ PS-IN-FILE INTO PRODUCT-WS.
           PERFORM 2000-PRODUCT-PARA UNTIL FS-PS-IN = "10".

           PERFORM 3000-CLOSE-PARA.

           PERFORM 4000-SHOW-STATS-PARA.

           DISPLAY "THANK YOU FOR USING PROGRAM COBPGM08".
           STOP RUN.
      *----------------------------------------------------------------
      *--- OPEN THE FILES ---------------------------------------------
      *----------------------------------------------------------------
       1000-OPEN-PARA.
           OPEN INPUT PS-IN-FILE.
           DISPLAY "PS-IN-FILE OPEN STATUS    : ", FS-PS-IN.

           OPEN OUTPUT KSDS-OUT-FILE.
           DISPLAY "KSDS-OUT-FILE OPEN STATUS : ", FS-KSDS-OUT.

           OPEN OUTPUT PS-ERR-FILE.
           DISPLAY "PS-ERR-FILE OPEN STATUS   : ", FS-PS-ERR.

           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS STUDENT RECORD -------------------------------------
      *----------------------------------------------------------------
       2000-PRODUCT-PARA.
           EVALUATE TRUE
               WHEN PROD-NAME-WS = SPACES OR BILL-WS = ZERO
                    WRITE ERROR-FILE-RB FROM PRODUCT-WS
                    COMPUTE INVALID-RECS = INVALID-RECS + 1
               WHEN BILL-WS IS NOT NUMERIC
                    WRITE ERROR-FILE-RB FROM PRODUCT-WS
                    COMPUTE INVALID-RECS = INVALID-RECS + 1
               WHEN OTHER
                    PERFORM 2100-PROCESS-PARA
                    WRITE OUTPUT-FILE-RB FROM OUTPUT-WS
                    COMPUTE VALID-RECS = VALID-RECS + 1
           END-EVALUATE.
           ADD 1 TO TOTAL-RECS.
           READ PS-IN-FILE INTO PRODUCT-WS.
           EXIT.
      *----------------------------------------------------------------
      *--- PERFORM CALCULATIONS ---------------------------------------
      *----------------------------------------------------------------
       2100-PROCESS-PARA.

      *--- MOVE DATA OF COMMON FIELDS FROM INPUT REC TO OUTPUT REC ----
           MOVE PROD-NAME-WS TO P-NAME-WS.
           MOVE BILL-WS  TO PRICE-AMT-WS.
           MOVE ROLL-NO-WS TO R-NO-WS.
           EVALUATE TRUE
                WHEN PRICE-AMT-WS < 1000
                     COMPUTE DISCOUNT-WS = 0.05 * PRICE-AMT-WS
                     MOVE "5% DISCOUNT" TO REMARKS-WS
                WHEN PRICE-AMT-WS >= 1000
                     COMPUTE DISCOUNT-WS = 0.07 * PRICE-AMT-WS
                     MOVE "7% DISCOUNT" TO REMARKS-WS
           END-EVALUATE.
           COMPUTE NET-AMT-WS = PRICE-AMT-WS - DISCOUNT-WS.
           EXIT.
      *----------------------------------------------------------------
      *--- CLOSE THE FILE ---------------------------------------------
      *----------------------------------------------------------------
       3000-CLOSE-PARA.
           DISPLAY " ".

           CLOSE PS-IN-FILE.
           DISPLAY "PS-IN-FILE CLOSE STATUS     : ", FS-PS-IN.

           CLOSE KSDS-OUT-FILE.
           DISPLAY "KSDS-OUT-FILE CLOSE STATUS  : ", FS-KSDS-OUT.

           CLOSE PS-ERR-FILE.
           DISPLAY "PS-ERR-FILE CLOSE STATUS    : ", FS-PS-ERR.

           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- DISPLAY THE STATISTICS -------------------------------------
      *----------------------------------------------------------------
       4000-SHOW-STATS-PARA.
           DISPLAY " ".
           DISPLAY "TOTAL RECORDS PROCESSED : ", TOTAL-RECS.
           DISPLAY "TOTAL RECORDS VALID     : ", VALID-RECS.
           DISPLAY "TOTAL RECORDS INVALID   : ", INVALID-RECS.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *----------------------------------------------------------------
