       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASSIG04.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01   STUDENT-RECORD.
            05      STUD-NAME    PIC A(10).
            05      FILLER       PIC X(01).
            05      MKS-1        PIC 9(03).9(02).
            05      FILLER       PIC X(01).
            05      MKS-2        PIC 9(03).9(02).
            05      FILLER       PIC X(01).
            05      MKS-3        PIC 9(03).9(02).
            05      FILLER       PIC X(01).
            05      TOTAL        PIC 9(03).9(02).
            05      FILLER       PIC X(01).
            05      PERC         PIC 9(03).9(02).
            05      FILLER       PIC X(01).
            05      RESULT       PIC A(04).
            05      FILLER       PIC X(01).
            05      REMARKS      PIC A(07).

       77           CTR          PIC  9(02)    VALUE 1.
       77           TOTAL-V      PIC  9(03)V9(02).
       77           PERC-V       PIC  9(03)V9(02).
       77           MKS-1-V      PIC  9(03)V9(02).
       77           MKS-2-V      PIC  9(03)V9(02).
       77           MKS-3-V      PIC  9(03)V9(02).
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : ASSIG04".
           DISPLAY " ".

           PERFORM 1000-STUDENT-PARA UNTIL CTR = 11.

           DISPLAY " ".
           DISPLAY "THANK YOU FOR USING PROGRAM ASSIG04".
           STOP RUN.
      *----------------------------------------------------------------
       1000-STUDENT-PARA.
           PERFORM 1100-ACCEPT-PARA.
           PERFORM 1200-VALIDATE-PARA.
           PERFORM 1300-CALCULATE-PARA.
           PERFORM 1400-DISPLAY-PARA.
           COMPUTE CTR = CTR + 1.
           EXIT.
      *----------------------------------------------------------------
       1100-ACCEPT-PARA.
           ACCEPT STUDENT-RECORD.

           MOVE MKS-1(1:3)    TO MKS-1-V(1:3).
           MOVE MKS-1(5:2)    TO MKS-1-V(4:2).

           MOVE MKS-2(1:3)    TO MKS-2-V(1:3).
           MOVE MKS-2(5:2)    TO MKS-2-V(4:2).

           MOVE MKS-3(1:3)    TO MKS-3-V(1:3).
           MOVE MKS-3(5:2)    TO MKS-3-V(4:2).
           EXIT.
      *----------------------------------------------------------------
       1200-VALIDATE-PARA.
           IF STUD-NAME = SPACES
              MOVE "INVALID" TO REMARKS
           ELSE
              IF MKS-1-V = 0 AND MKS-2-V = 0 AND MKS-3-V = 0
                 MOVE "INVALID" TO REMARKS
              ELSE
              IF MKS-1-V IS NOT NUMERIC AND MKS-2-V IS NOT NUMERIC AND
                           MKS-3-V IS NOT NUMERIC
                   MOVE "INVAID" TO REMARKS
                 ELSE
                    MOVE "VALID" TO REMARKS
               END-IF
              END-IF
           END-IF.
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS STUDENT DETAILS ------------------------------------
      *----------------------------------------------------------------
       1300-CALCULATE-PARA.
           ENDREMARKS =  "VALID"

           COMPUTE TOTAL-V = MKS-1-V + MKS-2-V + MKS-3-V
           COMPUTE PERC-V = TOTAL-V / 3.
           IF MKS-1-V >= 35 AND MKS-2-V >= 35 AND MKS-3-V >= 35
              MOVE "PASS" TO RESULT
           ELSE
              MOVE "FAIL" TO RESULT
           END-IF.

           DISPLAY STUDENT-RECORD.
           DISPLAY " ".

           EXIT.
      *----------------------------------------------------------------
       1400-DISPLAY-PARA.
           MOVE MKS-1-V TO MKS-1.
           MOVE MKS-2-V TO MKS-2.
           MOVE MKS-3-V TO MKS-3.
           MOVE TOTAL-V TO TOTAL.
           MOVE PERC-V  TO PERC.
           DISPLAY STUDENT-RECORD.
           EXIT.
