      *----------------------------------------------------------------
      *--- STRING/ UNSTRING -------------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASSIG07.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01    DATE-RECORD.
             05       DATE-1     PIC  X(10).
             05       FILLER     PIC  X(01).
             05       DATE-2     PIC  X(10).

       77             CTR        PIC  9(01)    VALUE 1.
       77             DD         PIC  9(02)    VALUE 0.
       77             MM         PIC  9(02)    VALUE 0.
       77             YYYY       PIC  9(04)    VALUE 0.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : COBPGM15".
           DISPLAY " ".

           PERFORM 1000-DATE-PARA UNTIL CTR = 6.

           DISPLAY " ".
           DISPLAY "THANK YOU FOR USING PROGRAM COBPGM15".
           STOP RUN.
      *----------------------------------------------------------------
      *--- CHANGE DATE FORMAT  FROM DD-MM-YYYY TO YYYY-MM-DD ----------
      *----------------------------------------------------------------
       1000-DATE-PARA.
           ACCEPT DATE-RECORD.

           UNSTRING DATE-1 INTO  DD, MM, YYYY

           STRING  DD       DELIMITED BY SIZE
                   "-"      DELIMITED BY SIZE
                   MM       DELIMITED BY SIZE
                   "-"      DELIMITED BY SIZE
                   YYYY     DELIMITED BY SIZE
             INTO  DATE-2.

           DISPLAY DATE-RECORD.

           COMPUTE CTR = CTR + 1.
           EXIT.
      *----------------------------------------------------------------
