      *----------------------------------------------------------------
      *--- SUB PROGRAM ------------------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SPGM01.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       LINKAGE SECTION.
       01   DATA-RECORD.
            05     EMPLOYEE-NAME        PIC X(10).
            05     FILLER               PIC X(01).
            05     BASIC-SAL            PIC 9(05).
            05     FILLER               PIC X(01).
            05     DA                   PIC 9(05).
            05     FILLER               PIC X(01).
            05     HRA                  PIC 9(05).
            05     FILLER               PIC X(01).
            05     GROSS                PIC 9(05).
      *----------------------------------------------------------------
       PROCEDURE DIVISION USING DATA-RECORD.
      *----------------------------------------------------------------
      *--- PROGRAM LOGICS STARTS HERE ---------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           COMPUTE DA = 0.4 * BASIC-SAL.
           COMPUTE HRA = 0.7 * BASIC-SAL.
           COMPUTE GROSS = DA + HRA.
           EXIT PROGRAM.
      *----------------------------------------------------------------
