      *----------------------------------------------------------------
      *--- MAIN PROGRAM -----------------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MPGM14.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUMBER-RECORD.
           05     NUM-1                PIC 9(04).
           05     FILLER               PIC X(01).
           05     NUM-2                PIC 9(04).
           05     FILLER               PIC X(01).
           05     RESULT               PIC 9(05).

       77         PGM-NAME             PIC X(08).
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : MPGM14".
           DISPLAY " ".

           ACCEPT NUMBER-RECORD.

           MOVE "SPGM14" TO PGM-NAME.
           CALL PGM-NAME USING NUMBER-RECORD.

           DISPLAY NUMBER-RECORD.

           DISPLAY " ".
           DISPLAY "THANK YOU FOR USING PROGRAM MPGM14".
           STOP RUN.
      *----------------------------------------------------------------
