      *----------------------------------------------------------------
      *--- DISPLAY ALL RECORDS OF KSDS IN SPOOL -----------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPGM09.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT KSDS-FILE ASSIGN TO DD01
           ORGANIZATION IS INDEXED
           ACCESS MODE IS SEQUENTIAL
           RECORD KEY IS EMP-NO-KSDS
           FILE STATUS IS FS-KSDS.
      *----------------------------------------------------------------
       DATA DIVISION.

       FILE SECTION.
       FD  KSDS-FILE
           LABEL RECORDS ARE STANDARD.
       01  KSDS-RB.
           05     EMP-NO-KSDS      PIC 9(03).
           05     FILLER           PIC X(77).
       WORKING-STORAGE SECTION.

           COPY WSREC.

           COPY FRMREC.

       77         FS-KSDS          PIC X(02)     VALUE SPACES.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO COBOL PROGRAM : COBPGM09".
           DISPLAY " ".

           PERFORM 1000-OPEN-PARA.

           READ KSDS-FILE INTO EMPLOYEE-WS.
           PERFORM 2000-EMPLOYEE-PARA UNTIL FS-KSDS = "10".

           PERFORM 3000-CLOSE-PARA.

           DISPLAY "THANK YOU FOR USING PROGRAM COBPGM09".
           STOP RUN.
      *----------------------------------------------------------------
      *--- OPEN THE FILE ----------------------------------------------
      *----------------------------------------------------------------
       1000-OPEN-PARA.
           OPEN INPUT KSDS-FILE.
           DISPLAY "KSDS OPEN STATUS : ", FS-KSDS.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS EMPLOYEE RECORD ------------------------------------
      *----------------------------------------------------------------
       2000-EMPLOYEE-PARA.
           MOVE EMP-NO-WS    TO EMP-NO-FRM-WS.
           MOVE EMP-NAME-WS  TO EMP-NAME-FRM-WS.
           MOVE PROJECT-WS   TO PROJECT-FRM-WS.
           MOVE MOBILE-NO-WS TO MOBILE-NO-FRM-WS.
           MOVE SALARY-WS    TO SALARY-FRM-WS.

           INSPECT EMP-NAME-FRM-WS REPLACING ALL "-" BY " ".

           INSPECT PROJECT-FRM-WS REPLACING ALL "-" BY " ".

           DISPLAY EMPLOYEE-FRM-WS.

           READ KSDS-FILE INTO EMPLOYEE-WS.
           EXIT.
      *----------------------------------------------------------------
      *--- CLOSE THE FILE ---------------------------------------------
      *----------------------------------------------------------------
       3000-CLOSE-PARA.
           CLOSE KSDS-FILE.
           DISPLAY " ".
           DISPLAY "KSDS CLOSE STATUS : ", FS-KSDS.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
