      *----------------------------------------------------------------
      *--- SUB PROGRAM ------------------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SPGM14.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       LINKAGE SECTION.
       01   DATA-RECORD.
            05   NUM-A        PIC 9(04).
            05   FILLER       PIC X(01).
            05   NUM-B        PIC 9(04).
            05   FILLER       PIC X(01).
            05   RES          PIC 9(05).
      *----------------------------------------------------------------
       PROCEDURE DIVISION USING DATA-RECORD.
      *----------------------------------------------------------------
      *--- PROGRAM LOGICS STARTS HERE ---------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           COMPUTE RES = NUM-A + NUM-B.
           EXIT PROGRAM.
      *----------------------------------------------------------------
