      *----------------------------------------------------------------
      *--- MAIN PROGRAM -----------------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MPGM15.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  STUDENT-RECORD.
           05     STUD-NAME            PIC X(10).
           05     FILLER               PIC X(01).
           05     MKS-1                PIC 9(03).
           05     FILLER               PIC X(01).
           05     MKS-2                PIC 9(03).
           05     FILLER               PIC X(01).
           05     MKS-3                PIC 9(03).
           05     FILLER               PIC X(01).
           05     TOTAL                PIC 9(03).
           05     FILLER               PIC X(01).
           05     PERCENT              PIC 9(02).
           05     FILLER               PIC X(01).
           05     RESULT               PIC X(04).

       77         PGM-NAME             PIC X(08).
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : MPGM15".
           DISPLAY " ".

           ACCEPT STUDENT-RECORD.

           MOVE "SPGM15" TO PGM-NAME.
           CALL PGM-NAME USING STUDENT-RECORD.

           DISPLAY STUDENT-RECORD.

           DISPLAY " ".
           DISPLAY "THANK YOU FOR USING PROGRAM MPGM15".
           STOP RUN.
      *----------------------------------------------------------------
