      *---------------------------------------------------------------
      *--- SPLIT A STRING INTO TWO OR MORE STRINGS -------------------
      *---------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPGM11.
      *---------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *---------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01   NAME-RECORD.
            05     FULL-NAME     PIC X(30).
            05     FILLER        PIC X(01).
            05     F-NAME        PIC X(10).
            05     FILLER        PIC X(01).
            05     M-NAME        PIC X(10).
            05     FILLER        PIC X(01).
            05     L-NAME        PIC X(10).
      *---------------------------------------------------------------
       PROCEDURE DIVISION.
      *---------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ---------------------------------
      *---------------------------------------------------------------
       0000-MAIN-PARA.
            DISPLAY "WELCOME TO MY PROGRAM : COBPGM11".
            DISPLAY " ".

            ACCEPT NAME-RECORD.

            UNSTRING FULL-NAME DELIMITED BY " "
                               INTO F-NAME, M-NAME, L-NAME.

            DISPLAY NAME-RECORD.

            DISPLAY " ".
            DISPLAY "THANK YOU FOR USING PROGRAM COBPGM10".

            STOP RUN.
      *---------------------------------------------------------------
