      *----------------------------------------------------------------
      *---  DISPLAY ALL RECORDS FROM PS FILE TO SPOOL -----------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPGM02.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *--- PS-FILE ENTRIES --------------------------------------------
           SELECT PS-FILE ASSIGN TO DD01
           ORGANIZATION IS SEQUENTIAL
           FILE STATUS IS FS-PS.
      *----------------------------------------------------------------
       DATA DIVISION.

       FILE SECTION.
       FD  PS-FILE
           LABEL RECORDS ARE STANDARD
           RECORDING MODE IS F.
       01  EMPLOYEE-RB.
           05    EMP-NAME-RB   PIC A(20).
           05    FILLER        PIC X(01).
           05    BASIC-SAL-RB  PIC 9(06).9(02).
           05    FILLER        PIC X(50).

       WORKING-STORAGE SECTION.
       01  EMPLOYEE-WS.
           05    EMP-NAME-WS   PIC A(20).
           05    FILLER        PIC X(01).
           05    BASIC-SAL-WS  PIC 9(06).9(02).

       77        FS-PS         PIC X(02)         VALUE SPACES.
       77        F-NAME        PIC X(10)         VALUE SPACES.
       77        M-NAME        PIC X(10)         VALUE SPACES.
       77        S-NAME        PIC X(10)         VALUE SPACES.
       77        TOTAL-RECS    PIC 9(02)         VALUE ZERO.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : COBPGM02".
           DISPLAY " ".

           PERFORM 1000-OPEN-PARA.

      *--- READ THE FIRST RECORD FROM THE FILE ------------------------
           READ PS-FILE INTO EMPLOYEE-WS.
           PERFORM 2000-EMPLOYEE-PARA UNTIL FS-PS = "10".

           PERFORM 3000-CLOSE-PARA.

           PERFORM 4000-SHOW-STATS-PARA.

           DISPLAY "THANK YOU FOR USING PROGRAM COBPGM01".
           STOP RUN.
      *----------------------------------------------------------------
      *--- OPEN THE FILE ----------------------------------------------
      *----------------------------------------------------------------
       1000-OPEN-PARA.
           OPEN INPUT PS-FILE.
           DISPLAY "PS-FILE OPEN STATUS : ", FS-PS.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS EMPLOYEE RECORD ------------------------------------
      *----------------------------------------------------------------
       2000-EMPLOYEE-PARA.
           PERFORM 2100-FORMAT-PARA.
           COMPUTE TOTAL-RECS = TOTAL-RECS + 1.

      *--- READ NEXT RECORD FROM THE FILE -----------------------------
           READ PS-FILE INTO EMPLOYEE-WS.

           EXIT.
      *----------------------------------------------------------------
      *--- FORMAT THE NAME --------------------------------------------
      *----------------------------------------------------------------
       2100-FORMAT-PARA.
           INSPECT EMP-NAME-WS REPLACING ALL "-" BY " ".

           UNSTRING EMP-NAME-WS DELIMITED BY SPACE
               INTO F-NAME, M-NAME, S-NAME.

           STRING S-NAME DELIMITED BY SPACE
                  " "    DELIMITED BY SIZE
                  F-NAME DELIMITED BY SPACE
                  " "    DELIMITED BY SIZE
                  M-NAME DELIMITED BY SPACE
             INTO EMP-NAME-WS.
           DISPLAY EMPLOYEE-WS.
           EXIT.
      *----------------------------------------------------------------
      *--- CLOSE THE FILE ---------------------------------------------
      *----------------------------------------------------------------
       3000-CLOSE-PARA.
           CLOSE PS-FILE.
           DISPLAY " ".
           DISPLAY "PS-FILE CLOSE STATUS    : ", FS-PS.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- DISPLAY THE STATISTICS -------------------------------------
      *----------------------------------------------------------------
       4000-SHOW-STATS-PARA.
           DISPLAY " ".
           DISPLAY "TOTAL RECORDS PROCESSED : ", TOTAL-RECS.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
