      *----------------------------------------------------------------
      *--- SEARCH A RECORD IN UNIQUE AIX CLUSTER ----------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPGM11.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT KSDS-FILE ASSIGN TO DD01
           ORGANIZATION IS INDEXED
           ACCESS MODE IS RANDOM
           RECORD KEY IS EMP-NO-KSDS
           ALTERNATE RECORD KEY IS MOBILE-NO-KSDS
           FILE STATUS IS FS-KSDS.
      *----------------------------------------------------------------
       DATA DIVISION.

       FILE SECTION.
       FD  KSDS-FILE
           LABEL RECORDS ARE STANDARD.
       01  KSDS-RB.
           05     EMP-NO-KSDS      PIC 9(03).
           05     FILLER           PIC X(28).
           05     MOBILE-NO-KSDS   PIC 9(10).
           05     FILLER           PIC X(39).

       WORKING-STORAGE SECTION.
       01  EMPLOYEE-WS.
           05     EMP-NO-WS        PIC 9(03).
           05     FILLER           PIC X(01).
           05     EMP-NAME-WS      PIC X(15).
           05     FILLER           PIC X(01).
           05     PROJECT-WS       PIC X(10).
           05     FILLER           PIC X(01).
           05     MOBILE-NO-WS     PIC 9(10).
           05     FILLER           PIC X(01).
           05     SALARY-WS        PIC 9(06).

       01  EMPLOYEE-FRM-WS.
           05     EMP-NO-FRM-WS    PIC 9(03).
           05     FILLER           PIC X(01).
           05     EMP-NAME-FRM-WS  PIC X(15).
           05     FILLER           PIC X(01).
           05     PROJECT-FRM-WS   PIC X(10).
           05     FILLER           PIC X(01).
           05     MOBILE-NO-FRM-WS PIC 9(10).
           05     FILLER           PIC X(01).
           05     SALARY-FRM-WS    PIC Z,ZZ,ZZ9.

       77         FS-KSDS          PIC X(02)     VALUE SPACES.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO COBOL PROGRAM : COBPGM11".
           DISPLAY " ".

           PERFORM 1000-OPEN-PARA.

           ACCEPT MOBILE-NO-KSDS.
           READ KSDS-FILE INTO EMPLOYEE-WS KEY IS MOBILE-NO-KSDS.

           EVALUATE TRUE
                WHEN FS-KSDS = "00"
                     MOVE EMP-NO-WS    TO EMP-NO-FRM-WS
                     MOVE EMP-NAME-WS  TO EMP-NAME-FRM-WS
                     MOVE PROJECT-WS   TO PROJECT-FRM-WS
                     MOVE MOBILE-NO-WS TO MOBILE-NO-FRM-WS
                     MOVE SALARY-WS    TO SALARY-FRM-WS

                     INSPECT EMP-NAME-FRM-WS REPLACING ALL "-" BY " "
                     INSPECT PROJECT-FRM-WS REPLACING ALL "-" BY " "

                     DISPLAY EMPLOYEE-FRM-WS
                WHEN FS-KSDS = "23"
                     DISPLAY MOBILE-NO-KSDS, " NOT FOUND IN KSDS"
                WHEN OTHER
                     DISPLAY MOBILE-NO-KSDS, " READ ERROR : ", FS-KSDS
           END-EVALUATE.

           PERFORM 2000-CLOSE-PARA.

           DISPLAY "THANK YOU FOR USING PROGRAM COBPGM11".
           STOP RUN.
      *----------------------------------------------------------------
      *--- OPEN THE FILE ----------------------------------------------
      *----------------------------------------------------------------
       1000-OPEN-PARA.
           OPEN INPUT KSDS-FILE.
           DISPLAY "KSDS OPEN STATUS : ", FS-KSDS.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- CLOSE THE FILE ---------------------------------------------
      *----------------------------------------------------------------
       2000-CLOSE-PARA.
           CLOSE KSDS-FILE.
           DISPLAY " ".
           DISPLAY "KSDS CLOSE STATUS : ", FS-KSDS.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
