      *----------------------------------------------------------------
      *---  DISPLAY VALID RECORDS IN SPOOL ----------------------------
      *---  WRITE INVALID RECORDS IN ERROR FILE -----------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPGM05.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *--- PS-FILE ENTRIES --------------------------------------------
           SELECT PS-FILE ASSIGN TO DD01
           ORGANIZATION IS SEQUENTIAL
           FILE STATUS IS FS-PS.

      *--- ERROR FILE ENTRIES -----------------------------------------
           SELECT ERR-FILE ASSIGN TO DD02
           ORGANIZATION IS SEQUENTIAL
           FILE STATUS IS FS-ERR.
      *----------------------------------------------------------------
       DATA DIVISION.

       FILE SECTION.
       FD  PS-FILE
           LABEL RECORDS ARE STANDARD
           RECORDING MODE IS F.
       01  EMPLOYEE-RB.
           05    FILLER        PIC X(80).

       FD  ERR-FILE
           LABEL RECORDS ARE STANDARD
           RECORDING MODE IS F.
       01  ERROR-RB.
           05    FILLER        PIC X(80).

       WORKING-STORAGE SECTION.
       01  EMPLOYEE-WS.
           05    EMP-NAME-WS   PIC X(20).
           05    FILLER        PIC X(01).
           05    PROJECT-WS    PIC X(10).
           05    FILLER        PIC X(01).
           05    SALARY-WS     PIC 9(06).

       77        FS-PS         PIC X(02)         VALUE SPACES.
       77        FS-ERR        PIC X(02)         VALUE SPACES.
       77        VALID-RECS    PIC 9(02)         VALUE ZERO.
       77        INVALID-RECS  PIC 9(02)         VALUE ZERO.
       77        TOTAL-RECS    PIC 9(02)         VALUE ZERO.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : COBPGM05".
           DISPLAY " ".

           PERFORM 1000-OPEN-PARA.

      *--- READ THE FIRST RECORD FROM THE FILE ------------------------
           READ PS-FILE INTO EMPLOYEE-WS.
           PERFORM 2000-EMPLOYEE-PARA UNTIL FS-PS = "10".

           PERFORM 3000-CLOSE-PARA.

           PERFORM 4000-SHOW-STATS-PARA.

           DISPLAY "THANK YOU FOR USING PROGRAM COBPGM05".
           STOP RUN.
      *----------------------------------------------------------------
      *--- OPEN THE FILE ----------------------------------------------
      *----------------------------------------------------------------
       1000-OPEN-PARA.
           OPEN INPUT PS-FILE.
           DISPLAY "PS-FILE OPEN STATUS  : ", FS-PS.

           OPEN OUTPUT ERR-FILE.
           DISPLAY "ERR-FILE OPEN STATUS : ", FS-ERR.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- PROCESS EMPLOYEE RECORD ------------------------------------
      *----------------------------------------------------------------
       2000-EMPLOYEE-PARA.
           EVALUATE TRUE
               WHEN EMP-NAME-WS = SPACES OR PROJECT-WS = SPACES OR
                                            SALARY-WS = 0
                    WRITE ERROR-RB FROM EMPLOYEE-WS
                    COMPUTE INVALID-RECS = INVALID-RECS + 1
               WHEN SALARY-WS IS NOT NUMERIC
                    WRITE ERROR-RB FROM EMPLOYEE-WS
                    COMPUTE INVALID-RECS = INVALID-RECS + 1
               WHEN PROJECT-WS NOT = "BANKING---" AND
                    PROJECT-WS NOT = "RETAIL----" AND
                    PROJECT-WS NOT = "FINANCE---"
                    WRITE ERROR-RB FROM EMPLOYEE-WS
                    COMPUTE INVALID-RECS = INVALID-RECS + 1
               WHEN OTHER
                    DISPLAY "VALID.. -> ", EMPLOYEE-WS
                    COMPUTE VALID-RECS = VALID-RECS + 1
           END-EVALUATE.
           COMPUTE TOTAL-RECS = TOTAL-RECS + 1.

      *--- READ NEXT RECORD FROM THE FILE -----------------------------
           READ PS-FILE INTO EMPLOYEE-WS.

           EXIT.
      *----------------------------------------------------------------
      *--- CLOSE THE FILE ---------------------------------------------
      *----------------------------------------------------------------
       3000-CLOSE-PARA.
           DISPLAY " ".

           CLOSE PS-FILE.
           DISPLAY "PS-FILE CLOSE STATUS     : ", FS-PS.

           CLOSE ERR-FILE.
           DISPLAY "ERR-FILE CLOSE STATUS    : ", FS-ERR.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
      *--- DISPLAY THE STATISTICS -------------------------------------
      *----------------------------------------------------------------
       4000-SHOW-STATS-PARA.
           DISPLAY " ".
           DISPLAY "TOTAL RECORDS PROCESSED : ", TOTAL-RECS.
           DISPLAY "TOTAL RECORDS VALID     : ", VALID-RECS.
           DISPLAY "TOTAL RECORDS INVALID   : ", INVALID-RECS.
           DISPLAY " ".
           EXIT.
      *----------------------------------------------------------------
