      *----------------------------------------------------------------
      *--- REPORT PROGRAM ---------------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPGM21.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

      *--- INPUT FILE ENTRIES -----------------------------------------
           SELECT IN-FILE ASSIGN TO DD01
           ORGANIZATION IS SEQUENTIAL
           FILE STATUS IS FS-IN.

      *--- OUTPUT FILE ENTRIES ----------------------------------------
           SELECT OUT-FILE ASSIGN TO DD02
           ORGANIZATION IS SEQUENTIAL
           FILE STATUS IS FS-OUT.
      *----------------------------------------------------------------
       DATA DIVISION.

       FILE SECTION.
      *--- INPUT  FILE ENTRIES ----------------------------------------
       FD  IN-FILE
           LABEL RECORDS ARE STANDARD
           RECORDING MODE IS F.
       01  IN-FILE-RB.
           05         FILLER          PIC X(80).
      *--- INPUT  FILE ENTRIES ----------------------------------------
       FD  OUT-FILE
           LABEL RECORDS ARE OMITTED.
       01  OUT-FILE-RB.
           05         FILLER          PIC X(80).

       WORKING-STORAGE SECTION.

       01  DATE-TIME-RECORD-REP.
           05         FILLER          PIC X(05)     VALUE SPACES.
           05         FILLER          PIC X(07)     VALUE "DATE : ".
           05         DATE-REP        PIC X(10)     VALUE SPACES.
           05         FILLER          PIC X(33)     VALUE SPACES.
           05         FILLER          PIC X(07)     VALUE "TIME : ".
           05         TIME-REP        PIC X(08)     VALUE SPACES.

       01  HEADING-RECORD-REP.
           05         FILLER          PIC X(30)     VALUE SPACES.
           05         FILLER          PIC X(11)     VALUE "XYZ COMPANY".

       01  HEADING-LINE-RECORD-REP.
           05         FILLER          PIC X(30)     VALUE SPACES.
           05         FILLER          PIC X(11)     VALUE ALL "-".

       01  FIELDS-RECORD-REP.
           05         FILLER          PIC X(15)     VALUE SPACES.
           05         FILLER          PIC X(08)     VALUE "EMP-NAME".
           05         FILLER          PIC X(27)     VALUE SPACES.
           05         FILLER          PIC X(06)     VALUE "SALARY".

       01  FIELDS-LINE-RECORD-REP.
           05         FILLER          PIC X(15)     VALUE SPACES.
           05         FILLER          PIC X(42)     VALUE ALL "-".

       01  BLANK-LINE-REP.
           05         FILLER          PIC X(80)     VALUE SPACES.

       01  DATA-RECORD-REP.
           05         FILLER          PIC X(15)     VALUE SPACES.
           05         EMP-NAME-REP    PIC X(15).
           05         FILLER          PIC X(18)     VALUE SPACES.
           05         SALARY-REP      PIC **,**,**9.

       01  TOTAL-SALARY-RECORD-REP.
           05         FILLER          PIC X(24)  VALUE SPACES.
           05         FILLER          PIC X(14)  VALUE "TOTAL SALARY :".
           05         FILLER          PIC X(10)  VALUE SPACES.
           05         TOT-SAL-REP     PIC **,**,**9.

       01  EMP-RECORD-WS.
           05         EMP-NAME-WS     PIC X(15).
           05         FILLER          PIC X(01).
           05         SALARY-WS       PIC 9(07).

       77             FS-IN           PIC X(02)     VALUE SPACES.
       77             FS-OUT          PIC X(02)     VALUE SPACES.
       77             DATE-TIME-WS    PIC X(14)     VALUE SPACES.
       77             TOT-SAL-WS      PIC 9(07)     VALUE 0.

       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY "WELCOME TO MY PROGRAM : REPORT"
           DISPLAY " ".

      *--- CAPTURE CURRENT DATE AND CURRENT TIME ----------------------
           MOVE FUNCTION CURRENT-DATE TO DATE-TIME-WS.

      *--- FORMAT  CURRENT DATE AND CURRENT TIME ----------------------
           STRING DATE-TIME-WS(7:2)   DELIMITED BY SIZE
                  "-"                 DELIMITED BY SIZE
                  DATE-TIME-WS(5:2)   DELIMITED BY SIZE
                  "-"                 DELIMITED BY SIZE
                  DATE-TIME-WS(1:4)   DELIMITED BY SIZE
             INTO DATE-REP.

           STRING DATE-TIME-WS(9:2)   DELIMITED BY SIZE
                  ":"                 DELIMITED BY SIZE
                  DATE-TIME-WS(11:2)  DELIMITED BY SIZE
                  ":"                 DELIMITED BY SIZE
                  DATE-TIME-WS(13:2)   DELIMITED BY SIZE
             INTO TIME-REP.

      *--- OPEN INPUT AND OUTPUT FILES --------------------------------
           OPEN INPUT IN-FILE.
           DISPLAY "IN-FILE OPEN STATUS : ", FS-IN.
           OPEN OUTPUT OUT-FILE.
           DISPLAY "OUT-FILE OPEN STATUS : ", FS-OUT.

      *--- DISPLAY REPORT HEADING AND FIELD HEADING IN REPORT ---------
           WRITE OUT-FILE-RB FROM DATE-TIME-RECORD-REP.
           WRITE OUT-FILE-RB FROM BLANK-LINE-REP.
           WRITE OUT-FILE-RB FROM BLANK-LINE-REP.
           WRITE OUT-FILE-RB FROM HEADING-RECORD-REP.
           WRITE OUT-FILE-RB FROM HEADING-LINE-RECORD-REP.
           WRITE OUT-FILE-RB FROM BLANK-LINE-REP.
           WRITE OUT-FILE-RB FROM FIELDS-LINE-RECORD-REP.
           WRITE OUT-FILE-RB FROM FIELDS-RECORD-REP.
           WRITE OUT-FILE-RB FROM FIELDS-LINE-RECORD-REP.

           READ IN-FILE INTO EMP-RECORD-WS.
           PERFORM EMPLOYEE-PARA UNTIL FS-IN = "10".

      *--- DISPLAY TOTAL SALARY IN REPORT -----------------------------
           WRITE OUT-FILE-RB FROM FIELDS-LINE-RECORD-REP.
           MOVE  TOT-SAL-WS  TO   TOT-SAL-REP.
           WRITE OUT-FILE-RB FROM TOTAL-SALARY-RECORD-REP.
           WRITE OUT-FILE-RB FROM FIELDS-LINE-RECORD-REP.

           CLOSE IN-FILE.
           CLOSE OUT-FILE.

           DISPLAY "THANK YOU FOR USING PROGRAM : COBPGM21".
           GOBACK.
       EMPLOYEE-PARA.
           MOVE  EMP-NAME-WS TO   EMP-NAME-REP.
           MOVE  SALARY-WS   TO   SALARY-REP.
           INSPECT EMP-NAME-REP REPLACING ALL "-" BY " ".
           COMPUTE TOT-SAL-WS = TOT-SAL-WS + SALARY-WS.
           WRITE OUT-FILE-RB FROM DATA-RECORD-REP.
           READ IN-FILE INTO EMP-RECORD-WS.
