      *----------------------------------------------------------------
      *--- STUDENT PROGRAM  - INSERT ROW IN DB2 TABLE -----------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. INSRT194.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  COMMAREA-WS.
           05       FLAG-WS       PIC X(01)           VALUE 'A'.

       01  DATE-TIME-RECORD.
           05       DATE-WS       PIC X(10)           VALUE SPACES.
           05       TIME-WS       PIC X(08)           VALUE SPACES.

       77           VALID-STATUS  PIC X(01)           VALUE 'N'.

      *--- PLUG-IN SYMBOLIC MAP ---------------------------------------
           COPY MAPS194.

      *--- PLUG-IN DFHAID   - CONTAINS CODE OF AID KEYS ---------------
           COPY DFHAID.

      *--- PLUG-IN DFHBMSCA - CONTAINS CODE FOR BLINKING AND COLORS ---
           COPY DFHBMSCA.

      *--- PLUG-IN SQLCA    - CONTAINS SQLCODE DECLARATION ------------
           EXEC SQL
                INCLUDE SQLCA
           END-EXEC.

      *--- PLUG-IN DCLGEN   - CONTAINS DEFN OF TABLE + HOST VARIABLES -
           EXEC SQL
                INCLUDE STUDTBL
           END-EXEC.

       LINKAGE SECTION.
      *--- COMMUNICATION AREA VARIABLE --------------------------------
       01  DFHCOMMAREA.
           05       FLAG-CA       PIC X(01).
      *----------------------------------------------------------------

       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           IF EIBCALEN = 0

      *--- INITIALIZE SYMBOLIC MAP VARIABLES --------------------------
              MOVE LOW-VALUE TO STUDMAPO

      *--- DISPLAY THE MAP ON THE SCREEN ------------------------------
              PERFORM 7000-SHOW-MAP-PARA

      *--- RELEASE PROGRAM TEMPORARILY FROM THE MEMORY ----------------
              PERFORM 8000-RELEASE-TEMP-PARA

           ELSE

              EVALUATE TRUE
                 WHEN EIBAID = DFHPF1
                      EXEC CICS
                           XCTL PROGRAM('MENUP194')
                      END-EXEC
                 WHEN EIBAID = DFHPF3
                      PERFORM 1000-CAPTURE-INPUT-PARA
                      PERFORM 2000-VALIDATE-INPUT-PARA
                      PERFORM 3000-CALCULATE-PARA
                      PERFORM 4000-INSERT-PARA
                      PERFORM 7000-SHOW-MAP-PARA
                      PERFORM 8000-RELEASE-TEMP-PARA
                 WHEN EIBAID = DFHPF7
                      MOVE LOW-VALUE TO STUDMAPO
                      PERFORM 7000-SHOW-MAP-PARA
                      PERFORM 8000-RELEASE-TEMP-PARA
                 WHEN OTHER
                      MOVE 'YOU HAVE PRESSED INVALID AID KEY' TO MESG2I
                      PERFORM 7000-SHOW-MAP-PARA
                      PERFORM 8000-RELEASE-TEMP-PARA
              END-EVALUATE

           END-IF.
      *----------------------------------------------------------------
      *--- CAPTURING THE INPUT FROM THE SCREEN TO I-VARIABLES ---------
      *----------------------------------------------------------------
       1000-CAPTURE-INPUT-PARA.
           EXEC CICS
                RECEIVE MAP('STUDMAP') MAPSET('MAPS194')
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
      *--- VALIDATE THE INPUT DATA ------------------------------------
      *----------------------------------------------------------------
       2000-VALIDATE-INPUT-PARA.
           EVALUATE TRUE
                WHEN ROLLNOL = 0 OR ROLLNOI = SPACES
                     MOVE 'PLEASE ENTER ROLL NUMBER !!!'    TO MESG2I
                     MOVE -1 TO ROLLNOL
                     MOVE DFHBLINK TO MESG2H
                WHEN NAMEL   = 0 OR NAMEI = SPACES
                     MOVE 'PLEASE ENTER STUDENT NAME !!!'   TO MESG2I
                     MOVE -1 TO NAMEL
                     MOVE DFHBLINK TO MESG2H
                WHEN MKS1L   = 0
                     MOVE 'PLEASE ENTER TEST 01 MARKS !!!'  TO MESG2I
                     MOVE -1 TO MKS1L
                     MOVE DFHBLINK TO MESG2H
                WHEN MKS2L   = 0
                     MOVE 'PLEASE ENTER TEST 02 MARKS !!!'  TO MESG2I
                     MOVE -1 TO MKS2L
                     MOVE DFHBLINK TO MESG2H
                WHEN MKS3L   = 0
                     MOVE 'PLEASE ENTER TEST 03 MARKS !!!'  TO MESG2I
                     MOVE -1 TO MKS3L
                     MOVE DFHBLINK TO MESG2H
                WHEN MKS1I IS NOT NUMERIC
                     MOVE 'MKS-01 HAS NON-NUMERIC DATA !!!' TO MESG2I
                     MOVE -1 TO MKS1L
                     MOVE DFHBLINK TO MESG2H
                WHEN MKS2I IS NOT NUMERIC
                     MOVE 'MKS-02 HAS NON-NUMERIC DATA !!!' TO MESG2I
                     MOVE -1 TO MKS2L
                     MOVE DFHBLINK TO MESG2H
                WHEN MKS3I IS NOT NUMERIC
                     MOVE 'MKS-03 HAS NON-NUMERIC DATA !!!' TO MESG2I
                     MOVE -1 TO MKS3L
                     MOVE DFHBLINK TO MESG2H
                WHEN OTHER
                     MOVE 'Y' TO VALID-STATUS
           END-EVALUATE.
           IF VALID-STATUS = 'N'
              PERFORM 6000-SHOW-MAP-CURSOR-PARA
              PERFORM 8000-RELEASE-TEMP-PARA
           END-IF.
           EXIT.
      *----------------------------------------------------------------
      *--- PERFORM CALCULATIONS ---------------------------------------
      *----------------------------------------------------------------
       3000-CALCULATE-PARA.
           COMPUTE TOTALI = MKS1I + MKS2I + MKS3I.
           COMPUTE PERCENTI = TOTALI / 3.
           IF MKS1I >= 35 AND MKS2I >= 35 AND MKS3I >= 35
              MOVE 'PASS' TO CLASSI
           ELSE
              MOVE 'FAIL' TO CLASSI
           END-IF.
           EVALUATE TRUE
              WHEN CLASSI = 'PASS' AND PERCENTI >= 75
                   MOVE 'DISTN' TO GRADEI
                   MOVE DFHBLINK TO GRADEH
              WHEN CLASSI = 'PASS' AND PERCENTI >= 60 AND PERCENTI < 75
                   MOVE 'FIRST' TO GRADEI
              WHEN CLASSI = 'PASS' AND PERCENTI >= 50 AND PERCENTI < 60
                   MOVE 'SECOND' TO GRADEI
              WHEN CLASSI = 'PASS' AND PERCENTI >= 35 AND PERCENTI < 50
                   MOVE 'THIRD' TO GRADEI
              WHEN OTHER
                   MOVE 'FAIL' TO GRADEI
                   MOVE DFHBLINK TO GRADEH
                   MOVE DFHRED TO GRADEC
           END-EVALUATE.
           EXIT.
      *----------------------------------------------------------------
      *--- INSERT THE ROW IN STUDENT TABLE ----------------------------
      *----------------------------------------------------------------
       4000-INSERT-PARA.
           MOVE ROLLNOI   TO   HV-ROLL-NO.
           MOVE NAMEI     TO   HV-STUD-NAME.
           MOVE MKS1I     TO   HV-MKS-1.
           MOVE MKS2I     TO   HV-MKS-2.
           MOVE MKS3I     TO   HV-MKS-3.
           MOVE TOTALI    TO   HV-TOTAL.
           MOVE PERCENTI  TO   HV-PERCENT.
           MOVE CLASSI    TO   HV-CLASS.
           MOVE GRADEI    TO   HV-GRADE.

           EXEC SQL
                INSERT INTO STUD_TBL VALUES(:HV-ROLL-NO,
                                            :HV-STUD-NAME,
                                            :HV-MKS-1,
                                            :HV-MKS-2,
                                            :HV-MKS-3,
                                            :HV-TOTAL,
                                            :HV-PERCENT,
                                            :HV-CLASS,
                                            :HV-GRADE)
           END-EXEC.

           EVALUATE TRUE
                WHEN SQLCODE = 0
                     MOVE '1 ROW INSERTED IN THE TABLE !!!'    TO MESG2I
                WHEN SQLCODE = -803
                     MOVE 'ROLL NUMBER ALREADY EXISTS !!!'     TO MESG2I
                WHEN OTHER
                     MOVE 'INSERT ERROR !!!'                   TO MESG2I
           END-EVALUATE.
           EXIT.
      *----------------------------------------------------------------
      *--- DISPLAY THE MAP ON THE SCREEN WITH CURSOR OPTION -----------
      *----------------------------------------------------------------
       6000-SHOW-MAP-CURSOR-PARA.
           MOVE 'OZA194'    TO   LOGIN2I.
           MOVE 'INSRT194'  TO   PGMNAME2I.
           EXEC CICS
                LINK PROGRAM('CDCT194') COMMAREA(DATE-TIME-RECORD)
           END-EXEC.
           MOVE DATE-WS     TO   CDATE2I.
           MOVE TIME-WS     TO   CTIME2I.
           EXEC CICS
                SEND MAP('STUDMAP') MAPSET('MAPS194') ERASE CURSOR
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
      *--- DISPLAY THE MAP ON THE SCREEN ------------------------------
      *----------------------------------------------------------------
       7000-SHOW-MAP-PARA.
           MOVE 'OZA194'    TO   LOGIN2I.
           MOVE 'INSRT194'  TO   PGMNAME2I.
           EXEC CICS
                LINK PROGRAM('CDCT194') COMMAREA(DATE-TIME-RECORD)
           END-EXEC.
           MOVE DATE-WS     TO   CDATE2I.
           MOVE TIME-WS     TO   CTIME2I.
           EXEC CICS
                SEND MAP('STUDMAP') MAPSET('MAPS194') ERASE
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
      *--- RELEASE THE PROGRAM TEMPORARILY FROM THE MEMORY ------------
      *----------------------------------------------------------------
       8000-RELEASE-TEMP-PARA.
           EXEC CICS
                RETURN TRANSID('D194') COMMAREA(COMMAREA-WS)
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
      *--- RELEASE THE PROGRAM PERMANENTLY FROM THE MEMORY ------------
      *----------------------------------------------------------------
       9000-QUIT-PARA.
           EXEC CICS
                RETURN
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
