      *----------------------------------------------------------------
      *--- LOGIN PROGRAM ----------------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOGIN194.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  COMMAREA-WS.
           05   FLAG-WS       PIC X(01)           VALUE 'A'.

       01  DATE-TIME-RECORD.
           05   DATE-WS       PIC X(10)           VALUE SPACES.
           05   TIME-WS       PIC X(08)           VALUE SPACES.

       01  MESSAGE-RECORD.
           05   LINE-01       PIC X(79)
                VALUE "THANK YOU FOR USING THIS APPLICATION".
           05   LINE-02       PIC X(79)
                VALUE "THIS APP WAS DEVELOPED BY ABC CONSULTANCY".
           05   LINE-03       PIC X(79)
                VALUE "FOR ANY QUERIES, YOU CAN CONTACT :".
           05   LINE-04       PIC X(79)
                VALUE "MOBILE : 9829382832 EMAIL : ABC.CONS@GMAIL.COM".

       77       VALID-STATUS  PIC X(01)           VALUE 'N'.
       77       RESP-VAR      PIC S9(08) COMP.

      *--- PLUG-IN SYMBOLIC MAP ---------------------------------------
           COPY MAPS194.

      *--- PLUG-IN DFHAID - CONTAINS CODE OF AID KEYS -----------------
           COPY DFHAID.

      *--- PLUG-IN DFHBMSCA - CONTAINS CODE FOR BLINKING AND COLORS ---
           COPY DFHBMSCA.

       LINKAGE SECTION.
      *--- COMMUNICATION AREA VARIABLE --------------------------------
       01  DFHCOMMAREA.
           05       FLAG-CA       PIC X(01).
      *----------------------------------------------------------------

       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           IF EIBCALEN = 0

      *--- INITIALIZE SYMBOLIC MAP VARIABLES --------------------------
              MOVE LOW-VALUE TO LOGMAPO

      *--- DISPLAY THE MAP ON THE SCREEN ------------------------------
              PERFORM 7000-SHOW-MAP-PARA

      *--- RELEASE PROGRAM TEMPORARILY FROM THE MEMORY ----------------
              PERFORM 8000-RELEASE-TEMP-PARA

           ELSE

              EVALUATE TRUE
                 WHEN EIBAID = DFHENTER
                      PERFORM 1000-CAPTURE-INPUT-PARA
                      PERFORM 2000-CHECK-DETAILS-PARA
                      PERFORM 6000-SHOW-MAP-CURSOR-PARA
                      PERFORM 8000-RELEASE-TEMP-PARA
                 WHEN OTHER
                      MOVE 'YOU HAVE PRESSED INVALID AID KEY' TO MESG1I
                      PERFORM 7000-SHOW-MAP-PARA
                      PERFORM 8000-RELEASE-TEMP-PARA
              END-EVALUATE

           END-IF.
      *----------------------------------------------------------------
      *--- CAPTURING THE INPUT FROM THE SCREEN TO I-VARIABLES ---------
      *----------------------------------------------------------------
       1000-CAPTURE-INPUT-PARA.
           EXEC CICS
                RECEIVE MAP('LOGMAP') MAPSET('MAPS194')
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
      *--- CHECK LOGIN CRDENTIALS -------------------------------------
      *----------------------------------------------------------------
       2000-CHECK-DETAILS-PARA.
            EVALUATE TRUE
                 WHEN LOGINI = 'QUITP'
                      PERFORM 9000-QUIT-PARA
                 WHEN LOGINI = 'ABCDE' AND PASSWDI = '12345'
                      EXEC CICS
                           XCTL PROGRAM('MENUP194')
                      END-EXEC
                 WHEN LOGINI = 'ABCDE' AND PASSWDI NOT = '12345'
                      MOVE 'ENTER VALID PASSWORD !!!'          TO MESG1I
                      MOVE -1 TO PASSWDL
                 WHEN LOGINI NOT = 'ABCDE' AND PASSWDI = '12345'
                      MOVE 'ENTER VALID LOGIN !!!'             TO MESG1I
                      MOVE -1 TO LOGINL
                 WHEN LOGINI NOT = 'ABCDE' AND PASSWDI NOT = '12345'
                      MOVE 'LOGIN+PASSWORD ARE INCORRECT !!!'  TO MESG1I
                      MOVE -1 TO LOGINL
            END-EVALUATE.
            EXIT.
      *----------------------------------------------------------------
      *--- DISPLAY THE MAP ON THE SCREEN WITH CURSOR OPTION -----------
      *----------------------------------------------------------------
       6000-SHOW-MAP-CURSOR-PARA.
           MOVE 'OZA194'    TO   LOGIN1I.
           MOVE 'LOGIN194'  TO   PGMNAME1I.
           EXEC CICS
                LINK PROGRAM('CDCT194') COMMAREA(DATE-TIME-RECORD)
           END-EXEC.
           MOVE DATE-WS     TO   CDATE1I.
           MOVE TIME-WS     TO   CTIME1I.
           EXEC CICS
                SEND MAP('LOGMAP') MAPSET('MAPS194') ERASE CURSOR
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
      *--- DISPLAY THE MAP ON THE SCREEN ------------------------------
      *----------------------------------------------------------------
       7000-SHOW-MAP-PARA.
           MOVE 'OZA194'    TO   LOGIN1I.
           MOVE 'LOGIN194'  TO   PGMNAME1I.
           EXEC CICS
                LINK PROGRAM('CDCT194') COMMAREA(DATE-TIME-RECORD)
           END-EXEC.
           MOVE DATE-WS     TO   CDATE1I.
           MOVE TIME-WS     TO   CTIME1I.
           EXEC CICS
                SEND MAP('LOGMAP')  MAPSET('MAPS194') ERASE
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
      *--- RELEASE THE PROGRAM TEMPORARILY FROM THE MEMORY ------------
      *----------------------------------------------------------------
       8000-RELEASE-TEMP-PARA.
           EXEC CICS
                RETURN TRANSID('L194') COMMAREA(COMMAREA-WS)
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
      *--- RELEASE THE PROGRAM PERMANENTLY FROM THE MEMORY ------------
      *----------------------------------------------------------------
       9000-QUIT-PARA.

      *--- CLEAR THE SCREEN -------------------------------------------
           EXEC CICS
                SEND CONTROL ERASE
           END-EXEC.

      *--- DISPLAY THANK YOU MESSAGE ON THE SCREEN --------------------
           EXEC CICS
                SEND TEXT FROM(MESSAGE-RECORD)
           END-EXEC.

      *--- RELEASE THE PROGRAM PERMANENTLY FROM THE MEMORY ------------
           EXEC CICS
                RETURN
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
