      *----------------------------------------------------------------
      *--- MENU PROGRAM -----------------------------------------------
      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MENU194.
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  COMMAREA-WS.
           05       FLAG-WS       PIC X(01)           VALUE 'A'.

       01  DATE-TIME-RECORD.
           05       DATE-WS       PIC X(10)           VALUE SPACES.
           05       TIME-WS       PIC X(08)           VALUE SPACES.

      *--- PLUG-IN SYMBOLIC MAP ---------------------------------------
           COPY MAPS194.

      *--- PLUG-IN DFHAID - CONTAINS CODE OF AID KEYS -----------------
           COPY DFHAID.

      *--- PLUG-IN DFHBMSCA - CONTAINS CODE FOR BLINKING AND COLORS ---
           COPY DFHBMSCA.

       LINKAGE SECTION.
      *--- COMMUNICATION AREA VARIABLE --------------------------------
       01  DFHCOMMAREA.
           05       FLAG-CA       PIC X(01).
      *----------------------------------------------------------------

       PROCEDURE DIVISION.
      *----------------------------------------------------------------
      *--- PROGRAM LOGIC STARTS HERE ----------------------------------
      *----------------------------------------------------------------
       0000-MAIN-PARA.
           IF EIBCALEN = 0

      *--- INITIALIZE SYMBOLIC MAP VARIABLES --------------------------
              MOVE LOW-VALUE TO MENUMAPO

      *--- DISPLAY THE MAP ON THE SCREEN ------------------------------
              PERFORM 7000-SHOW-MAP-PARA

      *--- RELEASE PROGRAM TEMPORARILY FROM THE MEMORY ----------------
              PERFORM 8000-RELEASE-TEMP-PARA

           ELSE

              EVALUATE TRUE
                 WHEN EIBAID = DFHENTER
                      PERFORM 1000-CAPTURE-INPUT-PARA
                      PERFORM 2000-CHECK-OPTION-PARA
                      PERFORM 7000-SHOW-MAP-PARA
                      IF OPTI = 3
                         PERFORM 9000-QUIT-PARA
                      ELSE
                         PERFORM 8000-RELEASE-TEMP-PARA
                      END-IF
                 WHEN OTHER
                      PERFORM 1000-CAPTURE-INPUT-PARA
                      MOVE 'YOU HAVE PRESSED INVALID AID KEY' TO MESG3I
                      PERFORM 7000-SHOW-MAP-PARA
                      PERFORM 8000-RELEASE-TEMP-PARA
              END-EVALUATE

           END-IF.
      *----------------------------------------------------------------
      *--- CAPTURING THE INPUT FROM THE SCREEN TO I-VARIABLES ---------
      *----------------------------------------------------------------
       1000-CAPTURE-INPUT-PARA.
           EXEC CICS
                RECEIVE MAP('MENUMAP') MAPSET('MAPS194')
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
      *--- CHECK LOGIN CRDENTIALS -------------------------------------
      *----------------------------------------------------------------
       2000-CHECK-OPTION-PARA.
            EVALUATE TRUE
                 WHEN OPTI = 1
                      EXEC CICS
                           XCTL PROGRAM('WRITE194')
                      END-EXEC
                 WHEN OPTI = 2
                      EXEC CICS
                           XCTL PROGRAM('INSRT194')
                      END-EXEC
                 WHEN OPTI = 3
                      EXEC CICS
                           XCTL PROGRAM('LOGIN194')
                      END-EXEC
                 WHEN OTHER
                      MOVE 'YOU HAVE ENTERED INVALID OPTION !' TO MESG3I
            END-EVALUATE.
            EXIT.
      *----------------------------------------------------------------
      *--- DISPLAY THE MAP ON THE SCREEN ------------------------------
      *----------------------------------------------------------------
       7000-SHOW-MAP-PARA.
           MOVE 'OZA194'     TO   LOGIN3I.
           MOVE 'MENUP194'   TO   PGMNAME3I.
           EXEC CICS
                LINK PROGRAM('CDCT194') COMMAREA(DATE-TIME-RECORD)
           END-EXEC.
           MOVE DATE-WS     TO   CDATE3I.
           MOVE TIME-WS     TO   CTIME3I.
           EXEC CICS
                SEND MAP('MENUMAP')  MAPSET('MAPS194') ERASE
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
      *--- RELEASE THE PROGRAM TEMPORARILY FROM THE MEMORY ------------
      *----------------------------------------------------------------
       8000-RELEASE-TEMP-PARA.
           EXEC CICS
                RETURN TRANSID('M194') COMMAREA(COMMAREA-WS)
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
      *--- RELEASE THE PROGRAM PERMANENTLY FROM THE MEMORY ------------
      *----------------------------------------------------------------
       9000-QUIT-PARA.
           EXEC CICS
                RETURN
           END-EXEC.
           EXIT.
      *----------------------------------------------------------------
