//OZA194J     JOB       '123-WIPRO','RAKESH',NOTIFY=&SYSUID,TIME=(2,30)
//*--------------------------------------------------------------------
//*-------- SORT SPECIFIC RECORD --------------------------------------
//*--------------------------------------------------------------------
//STEP01      EXEC       PGM=SORT
//SYSOUT      DD         SYSOUT=*
//SORTIN      DD         DSN=OZA194.WIPRO.EMPLOYEE.DATA,DISP=OLD
//SORTWK01    DD         UNIT=SYSDA,SPACE=(TRK,(1,1))
//SORTOUT     DD         SYSOUT=*
//*-----SORD CARD-----------------------------------------------------
//SYSIN       DD         *
 INCLUDE COND=(38,6,CH,LE,C'025000')
 SORT FIELDS=(6,20,CH,A)
/*
//*--------------------------------------------------------------------
