//OZA194J    JOB    '123-WIPRO','MADHAV',NOTIFY=&SYSUID,TIME=(2,30)
//*-------------------------------------------------------------------
//*--- DELETE A DATASET ----------------------------------------------
//*-------------------------------------------------------------------
//STEP01     EXEC   PGM=IEFBR14
//DD01       DD     DSN=OZA194.WIPRO.CHENNAI,DISP=(OLD,DELETE)
//DD02       DD     DSN=OZA194.WIPRO.BANGLOR,DISP=(OLD,DELETE)
//DD03       DD     DSN=OZA194.WIPRO.PUNE,DISP=(OLD,DELETE)
//DD04       DD     DSN=OZA194.WIPRO.EMPLOYEE.MASTER,DISP=(OLD,DELETE)
//*-------------------------------------------------------------------
