//OZA194J     JOB       '123-WIPRO','RAKESH',NOTIFY=&SYSUID,TIME=(2,30)
//*--------------------------------------------------------------------
//*----- SORT RECORDS AND FILTER COLUMNS OR FORMAT RECORDS IN OUTPUT--
//*--------------------------------------------------------------------
//STEP01      EXEC       PGM=SORT
//SYSOUT      DD         SYSOUT=*
//SORTIN      DD         DSN=OZA194.WIPRO.EMPLOYEE.DATA,DISP=OLD
//SORTWK01    DD         UNIT=SYSDA,SPACE=(TRK,(1,1))
//SORTOUT     DD         DSN=OZA194.WIPRO.FILE01,DISP=OLD
//*-----SORD CARD-----------------------------------------------------
//SYSIN       DD         *
 SORT FIELDS=COPY,SKIPREC=6
/*
//*--------------------------------------------------------------------
