//OZA194J     JOB       '123-WIPRO','RAKESH',NOTIFY=&SYSUID,TIME=(2,30)
//*--------------------------------------------------------------------
//*-------- SORT RECORDS ----------------------------------------------
//*--------------------------------------------------------------------
//STEP01      EXEC       PGM=SORT
//SYSOUT      DD         SYSOUT=*
//SORTIN      DD         DSN=OZA194.WIPRO.EMPLOYEE.DATA,DISP=OLD
//SORTWK01    DD         UNIT=SYSDA,SPACE=(TRK,(1,1))
//SORTOUT     DD         DSN=OZA194.WIPRO.EMPLOYEE.SORT.OUTPUT,DISP=OLD
//*---- SORD CARD -----------------------------------------------------
//SYSIN       DD         *
 SORT FIELDS=(27,10,CH,A,38,6,CH,D)
/*
//*--------------------------------------------------------------------
