//OZA194J     JOB       '123-WIPRO','RAKESH',NOTIFY=&SYSUID,TIME=(2,30)
//*--------------------------------------------------------------------
//*----- SORT RECORDS AND FILTER COLUMNS OR FORMAT RECORDS IN OUTPUT--
//*--------------------------------------------------------------------
//STEP01      EXEC       PGM=SORT
//SYSOUT      DD         SYSOUT=*
//SORTIN      DD         DSN=OZA194.WIPRO.EMPLOYEE.DATA,DISP=OLD
//SORTWK01    DD         UNIT=SYSDA,SPACE=(TRK,(1,1))
//SORTOUT     DD         SYSOUT=*
//*-----SORD CARD-----------------------------------------------------
//SYSIN       DD         *
 INREC FIELDS=(1,4,C' ',27,10)
 SORT FIELDS=(6,10,CH,A)
/*
//*--------------------------------------------------------------------
