//OZA194J    JOB   '123-WIPRO','MADHAV',NOTIFY=&SYSUID,TIME=(2,30)
//* ------------------------------------------------------------------
//* --- INSTREAM PROCEDURE : DEFAULT VALUE TO SYMBOLIC PARAMETER -----
//* ------------------------------------------------------------------
//SHOWDATA   PROC   FNAME='OZA194.WIPRO.EMPLOYEE.DATA'
//STEP01     EXEC   PGM=IEBGENER
//SYSPRINT   DD     SYSOUT=*
//SYSUT1     DD     DSN=&FNAME,DISP=OLD
//SYSUT2     DD     SYSOUT=*
//SYSIN      DD     DUMMY
//           PEND
//* ------------------------------------------------------------------
//* --- MAIN CODE ----------------------------------------------------
//* ------------------------------------------------------------------
//STEPA      EXEC   PROC=SHOWDATA,FNAME='OZA194.WIPRO.FINANCE'
//STEPB      EXEC   PROC=SHOWDATA
//STEPC      EXEC   PROC=SHOWDATA,FNAME='OZA194.WIPRO.BANKING'
//* ------------------------------------------------------------------
