//OZA194J   JOB   '123-WIPRO','MADHAV',NOTIFY=&SYSUID,TIME=(2,30)
//* -------------------------------------------------------------------
//* --- ELIMINATE DUPLICATE RECORDS -----------------------------------
//* -------------------------------------------------------------------
//STEP01    EXEC  PGM=SORT
//SYSOUT    DD    SYSOUT=*
//SORTIN    DD    DSN=OZA194.WIPRO.EMPLOYEE.DATA,DISP=OLD
//SORTWK01  DD    UNIT=SYSDA,SPACE=(TRK,(1,1))
//SORTOUT   DD    DSN=OZA194.WIPRO.FILE01,DISP=OLD
//* --- SORT CARD -----------------------------------------------------
//SYSIN     DD    *
 SORT FIELDS=(1,80,CH,A)
 SUM FIELDS=NONE
/*
//* -------------------------------------------------------------------
//* --- SPLIT ONE FILE INTO 3 FILES -----------------------------------
//* -------------------------------------------------------------------
//STEP02    EXEC  PGM=SORT
//SYSOUT    DD    SYSOUT=*
//SORTIN    DD    DSN=OZA194.WIPRO.FILE01,DISP=OLD
//SORTOF01  DD    DSN=OZA194.WIPRO.BANKING,DISP=OLD
//SORTOF02  DD    DSN=OZA194.WIPRO.FINANCE,DISP=OLD
//SORTOF03  DD    DSN=OZA194.WIPRO.RETAIL,DISP=OLD
//SYSIN     DD    *
 SORT FIELDS=COPY
 OUTFIL FILES=01,INCLUDE=(27,10,CH,EQ,C'BANKING---')
 OUTFIL FILES=02,INCLUDE=(27,10,CH,EQ,C'FINANCE---')
 OUTFIL FILES=03,INCLUDE=(27,10,CH,EQ,C'RETAIL----')
/*
//* -------------------------------------------------------------------
