//OZA194J    JOB    '123-WIPRO','RAKESH',NOTIFY=&SYSUID,TIME=(2,30)
//*--------------------------------------------------------------------
//*------ COPY DATA FROM DATASET TO DATASET ---------------------------
//*--------------------------------------------------------------------
//STEP01     EXEC       PGM=SORT
//SYSOUT     DD         SYSOUT=*
//SORTIN     DD         DSN=OZA194.WIPRO.CUSTOMER.PS,DISP=OLD
//SORTOUT    DD         DSN=OZA194.WIPRO.CUSTOMER.TEMP,DISP=OLD
//SYSIN      DD         *
 SORT FIELDS=COPY,SKIPREC=2
/*
//*--------------------------------------------------------------------
