//OZA194J     JOB     '123-WIPRO','MADHAV',NOTIFY=&SYSUID,TIME=(2,30)
//*-------------------------------------------------------------------
//*--- DEFINE A MODEL FOR THE GDG ------------------------------------
//*-------------------------------------------------------------------
//STEP01      EXEC    PGM=IEFBR14
//DD01        DD      DSN=OZA194WIPRO.PAYROOL.GDG,
// UNIT=SYSDA,
// DISP=(NEW,CATLG),
// SPACE=(TRK,(0)),
// DCB=(DSORG=PS,LRECL=80,RECFM=FB,BLKSIZE=400)
//*-------------------------------------------------------------------
