//OZA194J    JOB   '123-WIPRO','MADHAV',NOTIFY=&SYSUID,TIME=(2,30),
// MSGLEVEL=(2,0)
//* ------------------------------------------------------------------
//* --- INSTREAM PROCEDURE : DISPLAY DATASET CONTENTS IN SPOOL -------
//* ------------------------------------------------------------------
//SHOWDATA   PROC
//STEP01     EXEC   PGM=IEBGENER
//SYSPRINT   DD     SYSOUT=*
//SYSUT1     DD     DSN=OZA194.WIPRO.EMPLOYEE.DATA,DISP=OLD
//SYSUT2     DD     SYSOUT=*
//SYSIN      DD     DUMMY
//           PEND
//* ------------------------------------------------------------------
//* --- MAIN CODE ----------------------------------------------------
//* ------------------------------------------------------------------
//STEPA      EXEC   PROC=SHOWDATA
//STEPB      EXEC   SHOWDATA
//STEPC      EXEC   PROC=SHOWDATA
//* ------------------------------------------------------------------
